//--------------------------------------------------------------------------------//
/*!
	@file		IMACommand.h
	@brief		Image Mate Accent Qt用コマンド定義
*/
//--------------------------------------------------------------------------------//
#ifndef IMACOMMAND_H
#define IMACOMMAND_H
#include <QMetaType>

namespace IMACommand{
//--------------------------------------------------------------------------------//
/*!
	@brief	ペンパラメータ設定
	@details
			EL_CMD_KEY_PARAM1	qint32		ペン番号
			EL_CMD_KEY_PARAM2	qint32		パラメータタイプ
			EL_CMD_KEY_PARAM3	QVariant	値
			EL_CMD_KEY_PARAM4	QVariant	特殊設定(基本なし)
			特殊設定 : 自由色設定のとき1が入る
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_SET_PENPARAM	QUuid("{03209a48-935d-4b02-b078-81d35b9122c3}")

//--------------------------------------------------------------------------------//
/*!
	@brief	消しゴムパラメータ設定
	@details
			EL_CMD_KEY_PARAM1	qint32		消しゴムモード(0:全消し,1:部分消し)
			EL_CMD_KEY_PARAM2	bool		選択状態(false:非選択状態,true:選択状態)
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_SET_ERASERPARAM		QUuid("{A3D9F0A8-A6A8-4093-967A-3C8FDF9C5313}")

//--------------------------------------------------------------------------------//
/*!
	@brief	グリッド吸着
	@details
			EL_CMD_KEY_PARAM1	bool	tue:有効/false:無効
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_SET_SNAPGRID	QUuid("{0A641673-05F6-45d2-9F40-7FB5EA125BE8}")

//--------------------------------------------------------------------------------//
/*!
	@brief	オブジェクト設定
	@details
			EL_CMD_KEY_PARAM1	qint32	ペン番号
			EL_CMD_KEY_PARAM2	QString	オブジェクト名
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_SET_OBJECT	QUuid("{41624226-f905-41a1-8047-4a3280f971e7}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ペン番号設定
	@details
			EL_CMD_KEY_PARAM1	qint32	ペン番号
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_SET_PENNUMBER	QUuid("{3098fe15-2f99-4aee-aa54-0820c1c0a5b7}")

//--------------------------------------------------------------------------------//
/*!
	@brief	描画クリア
	@details
			EL_CMD_KEY_PARAM1	bool	強制全消去フラグ(true:全消去)
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_DRAW_CLEAR		QUuid("{91587f6f-ee54-4da0-ab60-3a9721286c04}")

//--------------------------------------------------------------------------------//
/*!
	@brief	SRSウィンドウ表示
	@details
			EL_CMD_KEY_PARAM1	bool 表示する場合はtrue,非表示にする場合false(オプション)
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_SHOW_SRSWINDOW	QUuid("{2e45d3ad-aca0-4d37-ac82-65e2f3836113}")

//--------------------------------------------------------------------------------//
/*!
	@brief	IMA終了
	@details
			なし
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_EXIT_IMA	QUuid("{b6776f21-da43-43a0-967d-fd54f373fe61}")

//--------------------------------------------------------------------------------//
/*!
	@brief	描画の上にいる可能性のあるウィジェットリスト追加
	@details
			ウィジェットの下から描画開始したくないものを通知(メニューのボタンなど)
			EL_CMD_KEY_PARAM1	QVariantList(QList<QWidgt*>)　ウィジェットリスト
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_ADD_DRAW_OVER_WIDGETS	QUuid("{3575ea6c-f2a4-471c-aecb-541f8403281c}")

//--------------------------------------------------------------------------------//
/*!
	@brief	描画の上にいる可能性のあるウィジェットリスト削除
	@details
			ウィジェットの下から描画開始したくないものを通知(メニューのボタンなど)
			EL_CMD_KEY_PARAM1	QVariantList(QList<QWidgt*>)　ウィジェットリスト
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_REMOVE_DRAW_OVER_WIDGETS	QUuid("{0304c969-f207-4401-b4e5-f1d8a27eaaaf}")

//--------------------------------------------------------------------------------//
/*!
	@brief	描画の上にいる可能性のあるウィジェットリスト追加
	@details
			アイテムの下から描画開始したくないものを通知(メニューのボタンなど)
			EL_CMD_KEY_PARAM1	QVariantList(QList<QGraphiscItem*>)　アイテムリスト
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_ADD_DRAW_OVER_ITEMS	QUuid("{26e35d75-4bee-4a84-939f-06d12bd64a8e}")

//--------------------------------------------------------------------------------//
/*!
	@brief	描画の上にいる可能性のあるウィジェットリスト削除
	@details
			アイテムの下から描画開始したくないものを通知(メニューのボタンなど)
			EL_CMD_KEY_PARAM1	QVariantList(QList<QGraphiscItem*>)　アイテムリスト
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_REMOVE_DRAW_OVER_ITEMS	QUuid("{ab6cee62-cad4-460f-8d0f-59a6685bafec}")

//--------------------------------------------------------------------------------//
/*!
	@brief	メニューインスタンス通知
	@details
			EL_CMD_KEY_PARAM1	QGraphicsItem*	メインメニュークラスインスタンス
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_MENU_INSTANCE	QUuid("{3cd13399-f945-498b-9e3a-b4c1428b0b79}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	PCモード変更
	@details
			EL_CMD_KEY_PARAM1	bool trueならPCモードへ移行、falseなら解除
			EL_CMD_KEY_PARAM2	bool trueならPCモードへ移行時にPC描画モードの描画内容消去、falseなら消去しない
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_CHANGE_PCMODE	QUuid("{16fced0e-23a9-4734-88ca-e57a6e58daff}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	コンテンツ読み出し画面表示要求
	@details
			送信パラメータ
			無し
			受信パラメータ
			無し
*/
/*--------------------------------------------------------------------------------*/
#define	IMA_CMD_LOAD_SHOW_CONTENTSSELECT	QUuid("{63A7AB55-8498-451e-B01F-9CECCCE13118}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	コンテンツ読み込み画面閉じる
	@details
			パラメータなし
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_LOAD_CLSOE_CONTENTSSELECT	QUuid("{8a0a8e64-5269-4d2b-a5ae-e5ccaae8e958}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	背景静止画ファイル要求
	@detail
			送信パラメータ
			EL_CMD_KEY_PARAM1	QString	背景にしたいファイルのパス
			受信パラメータ
			無し
*/
/*--------------------------------------------------------------------------------*/
#define	IMA_CMD_BG_PICTURE	QUuid("{A645F13D-1AFA-4d8b-809D-2E45F1F88D63}")


/*--------------------------------------------------------------------------------*/
/*!
	@brief	背景透過要求
	@detail
			送信パラメータ
			EL_CMD_KEY_PARAM1	bool	true:レイヤをクリア,false:なにもしない
			受信パラメータ
			無し
*/
/*--------------------------------------------------------------------------------*/
#define	IMA_CMD_BG_TRANSPARENT	QUuid("{232E4EB4-2400-4681-9166-5A4CCED2985B}")


/*--------------------------------------------------------------------------------*/
/*!
	@brief	背景書画カメラ要求
	@detail
			送信パラメータ
			無し
			受信パラメータ
			無し
*/
/*--------------------------------------------------------------------------------*/
#define	IMA_CMD_BG_CAMERA		QUuid("{743FDD04-07C7-4550-8A18-A37E7FDA9A47}")

//--------------------------------------------------------------------------------//
/*!
	@brief	背景白設定
	@detail
			パラメータなし
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_BG_WHITEBOARD	QUuid("{a25165f0-30a6-4baa-acd6-6320775e678c}")

//--------------------------------------------------------------------------------//
/*!
	@brief	メニュー領域設定
	@details
			EL_CMD_KEY_PARAM1	QRectF メニューを表示すべき領域
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_SET_MENURECT	QUuid("{54f81152-3c47-40e4-b045-d5a17c9aaa24}")

//--------------------------------------------------------------------------------//
/*!
	@brief	色ダイアログ表示要求
	@details
			送信パラメータ
			EL_CMD_KEY_PARAM1	QColor デフォルト色
			受信パラメータ
			EL_CMD_KEY_PARAM1	QColor 選択された色(選択されなければ無効色)
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_SHOW_COLORDIALOG	QUuid("{e1d47136-1f5b-4621-a62e-88a773dd3710}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Undo
	@details
			パラメータなし
*/
//--------------------------------------------------------------------------------//
#define IMA_CMD_UNDO	QUuid("{35cdabaa-3103-46c5-8577-0a428efca3b6}")


/*--------------------------------------------------------------------------------*/
/*!
	@brief	録画開始要求
	@detail
			送信パラメータ
			EL_CMD_KEY_PARAM1	QString	保存先フルパス。無い場合は自動的に、「(コンテンツ保存先)/YYYYMMDDHHmmSS.(拡張子)」となる
			受信パラメータ
			無し…なんだけどエラー値でも返したほうがいいか？
*/
/*--------------------------------------------------------------------------------*/
#define	IMA_CMD_REQ_REC_START		QUuid("{8D0EE39B-53DD-4939-BE35-219411AAED91}")


/*--------------------------------------------------------------------------------*/
/*!
	@brief	録画終了要求
	@detail
			送信パラメータ
			無し
			受信パラメータ
			無し
*/
/*--------------------------------------------------------------------------------*/
#define	IMA_CMD_REQ_REC_STOP		QUuid("{FC874B5B-60BC-4fc0-B038-5D7DD0AB59D5}")


/*--------------------------------------------------------------------------------*/
/*!
	@brief	録画開始要求(UVC)
	@detail
			送信パラメータ
			無し
			受信パラメータ
			無し
*/
/*--------------------------------------------------------------------------------*/
#define	IMA_CMD_REQ_REC_START_UVC		QUuid("{C5D45009-6944-422A-889A-12595CA7646C}")


/*--------------------------------------------------------------------------------*/
/*!
	@brief	録画終了要求(UVC)
	@detail
			送信パラメータ
			無し
			受信パラメータ
			無し
*/
/*--------------------------------------------------------------------------------*/
#define	IMA_CMD_REQ_REC_STOP_UVC		QUuid("{6040440F-C3F3-431E-9C8A-8C3EE20E5D53}")


/*--------------------------------------------------------------------------------*/
/*!
	@brief	録画開始通知
	@detail
			送信パラメータ
			EL_CMD_KEY_PARAM1	QString	保存先フルパス
			受信パラメータ
			無し
*/
/*--------------------------------------------------------------------------------*/
#define	IMA_CMD_NOTIFY_REC_STARTED	QUuid("{A011B4E9-980E-44a8-BBA3-84DE6C638338}")


/*--------------------------------------------------------------------------------*/
/*!
	@brief	録画停止通知
	@detail
			送信パラメータ
			EL_CMD_KEY_PARAM1	qint32	停止理由
			受信パラメータ
			無し
*/
/*--------------------------------------------------------------------------------*/
#define	IMA_CMD_NOTIFY_REC_STOPPED	QUuid("{5B1C2391-D1CC-43ee-9F36-FC55E000F9B4}")


/*--------------------------------------------------------------------------------*/
/*!
	@brief	キャプチャ画像要求
	@detail
			送信パラメータ
			EL_CMD_KEY_PARAM1	void*	コマンド発行者のポインタ
			EL_CMD_KEY_PARAM2	QSize	画像サイズ(オプション、なければそのままのサイズ)
			受信パラメータ
			EL_CMD_KEY_PARAM2	QPixmap	キャプチャ画像
*/
/*--------------------------------------------------------------------------------*/
#define	IMA_CMD_REQ_CAPTUREIMAGE	QUuid("{3120055A-CD3B-4f8f-B6A4-7CE63442E5B5}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	描画中かどうかを通知する
	@detail
			送信パラメータ
			EL_CMD_KEY_PARAM1	bool	true：描画中、false：描画中ではない
			受信パラメータ
			無し
*/
/*--------------------------------------------------------------------------------*/
#define	IMA_CMD_DRAW_DRAWING	QUuid("{5684C07B-AEC1-4828-8F5F-AF5784F6F6BB}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	カメラ画像停止通知
	@detail
			EL_CMD_KEY_PARAM1	bool	trueならば画像停止
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_CAMERA_FREEZE	QUuid("{a36820cb-fa16-4d64-9163-8abc32b0f4c0}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	スプリットスクリーン
	@detail
			EL_CMD_KEY_PARAM1	bool		trueならばスプリットスクリーン,falseならば解除
			EL_CMD_KEY_PARAM2	QStringList	画像リスト
			EL_CMD_KEY_PARAM3	qint32		メニュー位置
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_SPLITSCREEN	QUuid("{d5053206-9384-4bc9-9aa1-729c6b7d674e}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	マスク
	@detail
			EL_CMD_KEY_PARAM1	bool	trueならばマスク,falseならば解除
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_MASK	QUuid("{44dcfe29-8260-40e0-8aa2-ae852cf6acdc}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	ハイライト
	@detail
			EL_CMD_KEY_PARAM1	bool	trueならばハイライト,falseならば解除
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_HIGHLIGHT	QUuid("{2c39fbb1-3af2-4852-afb7-9aa612805547}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	スクロール
	@detail
			EL_CMD_KEY_PARAM1	bool	trueならばスクロール,falseならば解除
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_SCROLL	QUuid("{3394a02b-4d97-46dd-aea2-74f7498d4d3e}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	疑似スクロール　（PC描画モード限定：）
	@detail
			EL_CMD_KEY_PARAM1	bool	trueならばスクロール,falseならば解除
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_PSUEDO_SCROLL   QUuid("{E8BE9DA5-8EC6-4345-B27D-F8FBD8D554B1}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	モザイク
	@detail
			EL_CMD_KEY_PARAM1	bool	trueならばモザイク,falseならば解除
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_MOSAIC	QUuid("{7974F9DB-2B51-4284-BABE-690AE491DA30}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	前ページ
	@detail
			EL_CMD_KEY_PARAM1	bool	メイン背景かどうか(true:メイン,false:その他)
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_PAGE_PREV	QUuid("{F9888D12-9AA8-4ac8-95A3-D2567B8ED71F}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	次ページ
	@detail
			EL_CMD_KEY_PARAM1	bool	メイン背景かどうか(true:メイン,false:その他)
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_PAGE_NEXT	QUuid("{6E84F4BA-7800-42b9-B939-76B0F0EBD856}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	透過設定 (マスク/ハイライト)
	@detail
			EL_CMD_KEY_PARAM1	int		透過への追加値
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_ADD_MH_ALPHA	QUuid("{0b632dbc-093e-4c03-98e9-ec0a453b7b62}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	ズームレベル変更 (スクロール)
	@detail
			EL_CMD_KEY_PARAM1	int		ズームレベル変化量(-1, 1を想定）
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_CHANGE_ZOOM_LV	QUuid("{48AEE108-4036-42fc-8C5C-7219B2FF1629}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	モザイクレベル変更 (モザイク)
	@detail
			EL_CMD_KEY_PARAM1	int		レベル
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_CHANGE_MOSAIC_LV	QUuid("{34F4E842-BEE0-4cb2-9744-DEB4CE368700}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	描画モード変更
	@detal
			EL_CMD_KEY_PARAM1	int		eDrawMode
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_CHANGE_DRAWMODE QUuid("{53be3a92-7106-4979-ac5a-9d36f283995c}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	右側メニューのカスタム背景エリア更新要求
	@detail
			EL_CMD_KEY_PARAM1	QList<bool>	お気に入り背景のうち、変更されているものはtrue。
*/
/*--------------------------------------------------------------------------------*/
#define	IMA_CMD_MENU_REFLESH_BG	QUuid("{6D356F18-21B6-411d-A59F-7F29C7383ABD}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	右側メニューの最後に開いたファイル更新要求
	@detail
			EL_CMD_KEY_PARAM1	QList<QVariant>	お気に入り背景のうち、変更されているものはtrue。toBool()で取得すること。
*/
/*--------------------------------------------------------------------------------*/
#define	IMA_CMD_MENU_REFLESH_LASTOPEN	QUuid("{2D91B598-3207-4eba-8E4E-E54E9D334E9F}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	IMA内部用のキャプチャして保存することを要求するコマンド
	@detail
			EL_CMD_KEY_PARAM1	QString	保存先指定
			EL_CMD_KEY_PARAM2	QSize	画像サイズ(オプション、なければそのままのサイズ)
			EL_CMD_KEY_PARAM3	bool	範囲指定フラグ(false:全画面 / true:範囲指定)
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_SAVE_CAPTURE					QUuid("{4e449fe0-7dac-4311-adb5-da8098331ba3}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	画像挿入要求
	@detail
			EL_CMD_KEY_PARAM1	QString	挿入画像のパス
			EL_CMD_KEY_PARAM2	bool	画像選択中フラグ(true:選択中, false:選択済)
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_PICTURE	QUuid("{2BC6A7C7-7057-4fe6-90B3-0EB87FCDB2DD}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	スタンプ要求
	@detail
			EL_CMD_KEY_PARAM1	QString	挿入画像のパス
			EL_CMD_KEY_PARAM2	bool	フラグ
								・[パス有] false:位置を選んでスタンプ描画 / true:現在の位置にスタンプ描画
								・[パス無] false:スタンプ追加開始 / true:スタンプ追加終了
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_STAMP	QUuid("{2BB55832-3984-444a-864E-6FD745FEF7D5}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	オブジェクト選択状態通知
	@detail
			EL_CMD_KEY_PARAM1	bool	false:非選択状態,true:選択状態
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_OBJ_SELECTED	QUuid("{A65B629A-29D9-4b15-8542-E529E354CE2D}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	オブジェクト複製要求
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_OBJ_COPY	QUuid("{F21D61ED-5511-48e1-95EC-844E7A42C7A8}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	オブジェクト前面移動要求
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_OBJ_MOVEFRONT	QUuid("{1F59F741-18B6-4d67-9588-24C3012BEE08}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	オブジェクト背面移動要求
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_OBJ_MOVEBACK	QUuid("{68CD3A57-C589-4b9e-A5FA-3E1D4F76C0BF}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	選択モードに変更
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_CHANGE_SELECTMODE	QUuid("{0434e175-d5a3-4ecf-b61a-642abaf886bb}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	保存ファイル数変動通知
	@detail
			EL_CMD_KEY_PARAM1	QStringList	保存ファイルリスト
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_CHANGE_FILECNT	QUuid("{6F74800D-3132-4072-B6C0-488A804A2040}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	領域の更新要求
	@detail
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_UPDATE_RECT	QUuid("{E11569AC-C5EC-4f34-AC27-0BF31438D4D5}")

/*--------------------------------------------------------------------------------*/
/*!
	@brief	カメラ制御
	@detail
			EL_CMD_KEY_PARAM1	qint32	コマンド番号
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_CAMERA_CTRL	QUuid("{CFE46B6A-4422-4222-9835-FDD16A5408E4}")

/*--------------------------------------------------------------------------------*/
/*!
    @brief	メニュー非表示要求
    @detail
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_MENU_HIDE	QUuid("{5a0d69e9-9d5a-4d73-9add-3a6f1795f02e}")

/*--------------------------------------------------------------------------------*/
/*!
    @brief	ライブ開始通知
    @detail
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_LIVE_START	QUuid("{3EC0DB63-3F2F-4673-997A-4A66B11D1148}")

#if defined(ENABLE_VIDEO_PLAYBACK) //動画再生
/*--------------------------------------------------------------------------------*/
/*!
	@brief	動画再生要求
	@detail
			送信パラメータ
			EL_CMD_KEY_PARAM1	QString	再生にしたいファイルのパス
			受信パラメータ
			無し
*/
/*--------------------------------------------------------------------------------*/
#define	IMA_CMD_BG_VIDEO	QUuid("{69FA7E54-E3AC-447B-B688-FE202F9BA6FA}")

/*--------------------------------------------------------------------------------*/
/*!
    @brief	動画再生通知
    @detail
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_VIDEO_PLAY	QUuid("B3926E91-5745-40A3-BFFC-A4150311253B")

/*--------------------------------------------------------------------------------*/
/*!
    @brief	動画再生速度通知
    @detail
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_VIDEO_PLAYRATE	QUuid("02F5158A-A14B-452F-B076-55B7CBC6FF6A")

/*--------------------------------------------------------------------------------*/
/*!
    @brief	動画再生状態通知
    @detail
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_VIDEO_STATE	QUuid("3C20D173-FFEF-403F-8E01-D8914CA09989")

/*--------------------------------------------------------------------------------*/
/*!
    @brief	動画再生位置通知
    @detail
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_VIDEO_PLAYPOS_GET	QUuid("DF40C0D2-72E8-467C-8E08-0C0FA56EC366")

/*--------------------------------------------------------------------------------*/
/*!
    @brief	動画再生位置変更
    @detail
*/
/*--------------------------------------------------------------------------------*/
#define IMA_CMD_VIDEO_PLAYPOS_SET	QUuid("A427974E-9AB6-48DE-ADCA-2084D1FD6BE8")
#endif
}
#endif
