//***************************************************************************//
//***************************************************************************//
/*!
	@file		ClImageView.h
	@author		(S技1)高井
	@author		大橋
	@brief		画像表示ウィジェットのヘッダファイル
*/
//***************************************************************************//
//***************************************************************************//
#ifndef CLIMAGEVIEW_H
#define CLIMAGEVIEW_H


#include	<QWidget>


//***************************************************************************//
/*!
	@class	ClImageView
	@brief	画像表示ウィジェット

	設定された画像を表示するウィジェットである。<br>
	画像が設定されていなかったり、画像表示を無効にした場合、
	特定の色で塗りつぶされる。<br>
	デフォルトでは、白色で塗りつぶされる。
*/
//***************************************************************************//
class ClImageView : public QWidget
{
Q_OBJECT


	////////////////////////////////////////////////////////////////////
	//	生成・破棄
	////////////////////////////////////////////////////////////////////
public:
	ClImageView( QWidget  *pclParent = NULL );	//	引数つきコンストラクタ
	virtual ~ClImageView( void );				//	デストラクタ

	/*!
		@brief	描画画像取得
		@retval	描画する画像
	*/
	QImage getImage(){return m_clImg;}

	////////////////////////////////////////////////////////////////////
	//	シグナル
	////////////////////////////////////////////////////////////////////
signals:
	void		sigError( void );			//	エラーが発生したことを通知


	////////////////////////////////////////////////////////////////////
	//	スロット
	////////////////////////////////////////////////////////////////////
public slots:
	bool		slotSetImage( QString  strPath );		//	画像を設定(ファイルパス)
	bool		slotSetImage( QImage  clImg );			//	画像を設定(QImage)
	void		slotClearImage();	// 設定画像クリア
	void		slotSetBgColor( QColor  clColor );		//	塗りつぶし色を設定
	void		slotSetShowImg( bool  bShow );			//	画像表示ON/OFFを設定


	////////////////////////////////////////////////////////////////////
	//	オーバーライド
	////////////////////////////////////////////////////////////////////
protected:
	virtual void	paintEvent( QPaintEvent  *pclEvent );	//	描画処理


	////////////////////////////////////////////////////////////////////
	//	メンバー変数
	////////////////////////////////////////////////////////////////////
protected:
	bool		m_bShowImg;		//!<	画像を表示するならtrue
	QImage		m_clImg;		//!<	描画する画像
};


#endif // CLIMAGEVIEW_H
