//--------------------------------------------------------------------------------//
/*!
	@file	ClG711.h
	@brief	G.711エンコーダ・デコーダヘッダ
	@author	大橋
*/
//--------------------------------------------------------------------------------//
#ifndef CLG711_H
#define CLG711_H
#include <QByteArray>

//--------------------------------------------------------------------------------//
/*!
	@brief	G.711エンコーダ・デコーダ
*/
//--------------------------------------------------------------------------------//
class ClG711
{
public:
	typedef enum
	{
		eLAW_A = 0,
		eLAW_u
	}eLaw;
private:
	/*!
		@brief		コンストラクタ
	*/
	ClG711(){}

public:
	static QByteArray decode(QByteArray clData, eLaw eValue);	//デコード
	static QByteArray encode(QByteArray clData, eLaw eValue);	//エンコード
};
//--------------------------------------------------------------------------------//
#endif //CLG711_H
