//--------------------------------------------------------------------------------//
/*!
	@file	Command.h
	@brief	USBコマンド
	@author	大橋
	@author	星島
*/
//--------------------------------------------------------------------------------//
#ifndef COMMAND_H
#define COMMAND_H

#include <QString>
#include <QUuid>

//エラー値
#define USB_ERROR_SUCCESS		0		//成功
#define USB_ERROR_NO_DEVICE		((quint16)0xef00)	//デバイスがない/
#define USB_ERROR_BAD_PARAM		((quint16)0xef01)	//パラメータエラー
#define USB_ERROR_BUSY			((quint16)0xef02)	//ビジーエラー
#define USB_ERROR_TIMEOUT		((quint16)0xef03)	//タイムアウトエラー
#define USB_ERROR_RECEIVE_DATA	((quint16)0xef04)	//受信データが不正エラー
#define USB_ERROR_OTHER			((quint16)0xef05)	//何かのエラー

#define USB_ERROR_BEGIN_QT		(USB_ERROR_NO_DEVICE)
#define USB_ERROR_END_QT		(USB_ERROR_OTHER)

//--------------------------------------------------------------------------------//
/*!
	@brief	Descriptor通知
	@details
			EL_CMD_KEY_PARAM1	QString デスクリプタ情報文字列
*/
//--------------------------------------------------------------------------------//
#define USB_CMD_DESCRIPTOR_INFO QUuid("{9603e69d-8799-4090-bdd9-0c9947420018}")

//--------------------------------------------------------------------------------//
/*!
	@brief	デバイスオープン通知
	@details
			EL_CMD_KEY_PARAM1	void* オープンしたデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 QBIC_VALUE_TYPE_* カメラ種別
			EL_CMD_KEY_PARAM3	quint16 カメラ種別取得エラー値
*/
//--------------------------------------------------------------------------------//
#define USB_CMD_DEVICE_OPEN QUuid("{91c4b98b-89a7-492c-b06d-822bd360404c}")

//--------------------------------------------------------------------------------//
/*!
	@brief	デバイスクローズ通知
	@details
			EL_CMD_KEY_PARAM1	void* クローズしたデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_CMD_DEVICE_CLOSE QUuid("{dee588aa-f78f-4d39-a56b-85a17a588ead}")

//--------------------------------------------------------------------------------//
/*!
	@brief	データ送信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QByteArray 送信データ
*/
//--------------------------------------------------------------------------------//
#define USB_CMD_SEND_DATA QUuid("{405bfe84-a8f7-4a4a-bee9-790a3d3adc9d}")

//--------------------------------------------------------------------------------//
/*!
	@brief	受信データ通知
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QByteArray 受信データ
*/
//--------------------------------------------------------------------------------//
#define USB_CMD_NOTIFY_RECEIVE_DATA QUuid("{cb20cb36-4046-4332-a0d4-f8aa0220a035}")

//--------------------------------------------------------------------------------//
/*!
	@brief	USB通信エラー
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QUuid 要求コマンド
			EL_CMD_KEY_PARAM3	quint16 エラー値
*/
//--------------------------------------------------------------------------------//
#define USB_CMD_ERROR QUuid("{3a39c6b1-7268-419d-b80b-a4bc35994ae2}")

//--------------------------------------------------------------------------------//
/*!
	@brief	取得コマンド以外のQBiCからの返信通知
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QUuid 要求コマンド
			EL_CMD_KEY_PARAM3	quint16 処理結果
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_RESPONSE QUuid("{92ea7622-4687-4056-a57d-b00de314ad18}")

//--------------------------------------------------------------------------------//
/*!
	@breif	Wi-Fi情報取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_WIFI_INFO QUuid("{a5a94cad-baf0-40bc-828c-532ba8aebacb}")

//--------------------------------------------------------------------------------//
/*!
	@breif	Wi-Fi情報取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 QBIC_VALUE_WIFI_LINK_*
			EL_CMD_KEY_PARAM3	QString SSID
			EL_CMD_KEY_PARAM4	QString MACアドレス
			EL_CMD_KEY_PARAM5	quint32 チャネル
			EL_CMD_KEY_PARAM6	quint32 暗号方式 QBIC_VALUE_WIFI_CODE_*
			EL_CMD_KEY_PARAM7	quint32 認証方式 QBIC_VALUE_WIFI_AUTH_*
			EL_CMD_KEY_PARAM8	qint32 RSSI(dbm)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_WIFI_INFO QUuid("{9ee90927-90b6-4a0c-87e7-dfb25d8b4ebd}")


//--------------------------------------------------------------------------------//
/*!
	@brief	アクセスポイントリスト要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_ACCESSPOINT_LIST QUuid("{5568656a-bde3-4b7e-a4c6-3237c4cc3467}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アクセスポイントリスト通知
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	AccesspointList アクセスポイント情報リスト
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_ACCESSPOINT_LIST QUuid("{02819921-1da3-4ea8-93ee-f98e1b356549}")


//--------------------------------------------------------------------------------//
/*!
	@brief	Wi-Fi接続方式取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_WIFIMODE QUuid("{86dfcbdd-3d90-4735-ba92-9bc9f07db88e}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Wi-Fi接続方式取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 QBIC_VALUE_WIFI_CONNECT_*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_WIFIMODE QUuid("{7a29d94a-4e03-4c8f-aea2-f97ebacf4c5b}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Wi-Fi接続方式設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 QBIC_VALUE_WIFI_CONNECT_*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_WIFI_MODE QUuid("{2217ae55-f345-4577-9ba3-be53fb9936b7}")


//--------------------------------------------------------------------------------//
/*!
	@brief	ストリーム認証使用設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_STREAM_AUTHORIZATION_USE QUuid("{b0be2cfd-c0ea-449b-b1b1-84a0074abff4}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ストリーム認証使用設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 認証使用するならtrue
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_STREAM_AUTHORIZATION_USE QUuid("{94cddf8c-8ee6-4d24-a085-146c9eb4ec0a}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ストリーム認証使用設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 認証使用するならtrue
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_STREAM_AUTHORIZATION_USE QUuid("{7d41fca2-2e0f-4277-a143-7c20d6960c5c}")


//--------------------------------------------------------------------------------//
/*!
	@brief	ストリーム認証パスワード取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_STREAM_AUTHORIZATION_PASSWORD QUuid("{e41edfb3-32b4-4e3d-9a7c-66ec0e560a99}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ストリーム認証パスワード取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString パスワード
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_STREAM_AUTHORIZATION_PASSWORD QUuid("{fefb3179-a582-4fe3-a3de-ff4d0238e8e2}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ストリーム認証パスワード設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString パスワード
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_STREAM_AUTHORIZATION_PASSWORD QUuid("{b6117a73-1bc4-4de9-967e-adb82c23e596}")


//--------------------------------------------------------------------------------//
/*!
	@brief	アドホック接続IPアドレス取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_ADHOC_ADDRESS QUuid("{4e644a00-84e9-45e2-9f17-4785b8c92727}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アドホック接続IPアドレス取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString アドレス(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_ADHOC_ADDRESS QUuid("{51a931a5-da62-4137-ac87-4afbba089817}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アドホック接続IPアドレス設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString アドレス(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_ADHOC_ADDRESS QUuid("{3c44c8a4-cbf3-4636-b2aa-122164a12303}")


//--------------------------------------------------------------------------------//
/*!
	@brief	アドホック接続サブネットマスク取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_ADHOC_SUBNETMASK QUuid("{8b3b0765-c3cd-47ee-87df-02b7930bc773}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アドホック接続サブネットマスク取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString サブネットマスク(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_ADHOC_SUBNETMASK QUuid("{bc1f5003-484c-4c0f-a2f6-a0e6d2c0c274}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アドホック接続サブネットマスク設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString サブネットマスク(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_ADHOC_SUBNETMASK QUuid("{418cfee0-2f55-41ee-946f-d3a4bf214536}")


//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ接続DHCPサーバ使用設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_INFRA_USE_DHCP QUuid("{769dc517-af0f-4040-8d03-4704a9cf0f40}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ接続DHCPサーバ使用設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool DHCPサーバを使用するならtrue
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_INFRA_USE_DHCP QUuid("{f4c80d59-15c5-4be6-9346-48b5e946c598}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ接続DHCPサーバ使用設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool DHCPサーバを使用するならtrue
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_INFRA_USE_DHCP QUuid("{81fc82e8-3ead-4f85-a912-ba797c06bbf1}")


//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ接続IPアドレス取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_INFRA_ADDRESS QUuid("{808e1947-66a7-4198-81c4-f615addcd62a}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ接続IPアドレス取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString アドレス(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_INFRA_ADDRESS QUuid("{09947697-ed7b-4108-8c02-c1fd01548075}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ接続IPアドレス設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString アドレス(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_INFRA_ADDRESS QUuid("{26e6d317-c746-49b5-81ca-94fb61c564a5}")


//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ接続サブネットマスク取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_INFRA_SUBNETMASK QUuid("{59fd82d9-970f-4375-b8cc-d73cad2e15e5}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ接続サブネットマスク取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString サブネットマスク(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_INFRA_SUBNETMASK QUuid("{8c377ee8-ae3c-4347-9267-b1c635dd1be2}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ接続サブネットマスク設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString サブネットマスク(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_INFRA_SUBNETMASK QUuid("{14b32708-bec7-4a95-ac0e-44720ab53e39}")


//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ接続デフォルトゲートウェイ取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_INFRA_GATEWAY QUuid("{4f18199a-e44b-42cf-916c-7cba4ee33e03}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ接続デフォルトゲートウェイ取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString デフォルトゲートウェイ(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_INFRA_GATEWAY QUuid("{6d554b49-18df-441c-9293-921bfd80b710}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ接続デフォルトゲートウェイ設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString デフォルトゲートウェイ(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_INFRA_GATEWAY QUuid("{6ff5876b-0ad2-4c89-92d7-43cc541370ee}")


//--------------------------------------------------------------------------------//
/*!
	@brief	録画状態取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_IS_REC QUuid("{3171d281-a022-4ac1-bb58-19d4be7e886e}")

//--------------------------------------------------------------------------------//
/*!
	@brief	録画状態取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 QBIC_VALUE_REC_STATE_*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_IS_REC QUuid("{d4b0cf96-78e8-4df1-b0ac-2ca242695dc5}")


//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ接続デフォルトゲートウェイ取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_INTERVAL_INFO QUuid("{63771dc3-5959-4b92-97a7-e2fd0a46b3d7}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ接続デフォルトゲートウェイ取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 使用するならtrue
			EL_CMD_KEY_PARAM3	quint32 撮影開始までの時間(秒)
			EL_CMD_KEY_PARAM4	quint32 撮影間隔(秒)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_INTERVAL_INFO QUuid("{5f4533c1-94c0-4a76-97cf-1ce1e5456b49}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ接続デフォルトゲートウェイ設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 使用するならtrue
			EL_CMD_KEY_PARAM3	quint32 撮影開始までの時間(0~259200)(秒)
			EL_CMD_KEY_PARAM4	quint32 撮影間隔(0~259200)(秒)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_INTERVAL_INFO QUuid("{68e1b3d9-df5e-4021-bc06-5d8543297109}")


//--------------------------------------------------------------------------------//
/*!
	@brief	録画画像サイズ取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_REC_IMAGESIZE QUuid("{daf9ae45-7b86-4dc8-8b26-2c9be3d3ed03}")

//--------------------------------------------------------------------------------//
/*!
	@brief	録画画像サイズ取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 解像度(旧S: 1:1920x1080, 2:1280x720,
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_REC_IMAGESIZE QUuid("{a0cdf72b-e772-4a0f-b337-f3cc6b53407f}")

//--------------------------------------------------------------------------------//
/*!
	@brief	録画画像サイズ設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 解像度(旧S: 1:1920x1080, 2:1280x720,
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_REC_IMAGESIZE QUuid("{e2667492-f8f7-4812-8614-533a9f0837f5}")


//--------------------------------------------------------------------------------//
/*!
	@brief	録画フレームレート取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_REC_FRAMERATE QUuid("{13fbe557-f16d-4d38-8a76-296f5cb6183e}")

//--------------------------------------------------------------------------------//
/*!
	@brief	録画フレームレート取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 フレームレート
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_REC_FRAMERATE QUuid("{ff088e9a-40c1-4dfa-9b76-ed74cc21b781}")

//--------------------------------------------------------------------------------//
/*!
	@brief	録画フレームレート設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 フレームレート(1,6,15,30)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_REC_FRAMERATE QUuid("{effbe0bc-899b-4800-8f6f-026d765e6b25}")


//--------------------------------------------------------------------------------//
/*!
	@brief	録画ビットレート取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_REC_BITRATE QUuid("{6239F2F0-15FB-48dc-8526-E8C9EF9BA26F}")

//--------------------------------------------------------------------------------//
/*!
	@brief	録画ビットレート取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 ビットレート
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_REC_BITRATE QUuid("{A57AB83F-E91F-4a79-AC17-9BF97D791F63}")

//--------------------------------------------------------------------------------//
/*!
	@brief	録画ビットレート設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 ビットレート
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_REC_BITRATE QUuid("{3C3FB534-47C5-4e04-92A2-59C8CB0EDAA9}")


//--------------------------------------------------------------------------------//
/*!
	@brief	Live画像サイズ取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_LIVE_IMAGESIZE QUuid("{11ba1817-5366-4862-8866-20ab8fce80a6}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Live画像サイズ取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 解像度(旧S: 1:800x480, 2:320x240,
												新S: 1:800x480, 2:432x240, 3:640x360)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_LIVE_IMAGESIZE QUuid("{d6eadd7d-e953-42d9-88c5-0736ba570f8a}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Live画像サイズ設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 解像度(旧S: 1:800x480, 2:320x240,
											新S: 1:800x480, 2:432x240, 3:640x360)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_LIVE_IMAGESIZE QUuid("{ae8eb251-e235-4b2d-a51c-d27a4c9cd57f}")


//--------------------------------------------------------------------------------//
/*!
	@brief	Liveフレームレート取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_LIVE_FRAMERATE QUuid("{e0228344-1685-46c0-b77c-0b8f96b4aa7e}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Liveフレームレート取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 フレームレート
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_LIVE_FRAMERATE QUuid("{09fdadec-bb47-4dc6-8d7d-b197d7b29729}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Liveフレームレート設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 フレームレート(1,6,15,30)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_LIVE_FRAMERATE QUuid("{ba08a7cb-c5c3-4979-a581-07e3e1ffc3ba}")


//--------------------------------------------------------------------------------//
/*!
	@brief	Liveビットレート取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_LIVE_BITRATE QUuid("{E1FD940C-9135-450a-867E-9378AC3D339A}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Liveビットレート取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 ビットレート
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_LIVE_BITRATE QUuid("{F564D797-C0A2-41f4-AE54-31D5B4E25E21}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Liveビットレート設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 ビットレート
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_LIVE_BITRATE QUuid("{134EED8B-FF59-457b-BEE2-2A42866CE978}")


//--------------------------------------------------------------------------------//
/*!
	@brief	GPS情報取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 取得種別 QBIC_VALUE_GPS_INFO_*
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_GPSINFO QUuid("{0cbcc8f8-03ee-41af-9a3d-c4d8b6ed63e7}")

//--------------------------------------------------------------------------------//
/*!
	@brief	GPS情報取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 取得種別 QBIC_VALUE_GPS_INFO_*
			EL_CMD_KEY_PARAM3	QString GPS情報
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_GPSINFO QUuid("{02a3da66-cdef-4336-a002-b37bf65b0023}")

//--------------------------------------------------------------------------------//
/*!
	@brief	GPS設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_GPSSETTING QUuid("{d491ffdd-4a1e-4e78-b073-828312d1e2fb}")

//--------------------------------------------------------------------------------//
/*!
	@brief	GPS設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool GPS使用設定
			EL_CMD_KEY_PARAM3	bool ログ出力設定
			EL_CMD_KEY_PARAM4	bool 時刻補正使用設定
			EL_CMD_KEY_PARAM5	quint32 ログ形式 QBIC_VALUE_GPS_LOG_TYPE_*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_GPSSETTING QUuid("{6ab9df44-e2b3-4f42-b73d-8e208fcb2880}")

//--------------------------------------------------------------------------------//
/*!
	@brief	GPS設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool GPS使用設定
			EL_CMD_KEY_PARAM3	bool ログ出力設定
			EL_CMD_KEY_PARAM4	bool 時刻補正使用設定
			EL_CMD_KEY_PARAM5	quint32 ログ形式 QBIC_VALUE_GPS_LOG_TYPE_*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_GPSSETTING QUuid("{02f22d7e-f5b0-4db9-95de-08c6959174a5}")

//--------------------------------------------------------------------------------//
/*!
	@brief	カメラ名取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_CAMERANAME QUuid("{ddcf6ff7-bf78-46c0-bb4f-56a99af4f3bd}")

//--------------------------------------------------------------------------------//
/*!
	@brief	カメラ名取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString カメラ名
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_CAMERANAME QUuid("{54046b3c-4d44-4baa-87ba-5b19a3f4cc48}")

//--------------------------------------------------------------------------------//
/*!
	@brief	カメラ名設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString カメラ名
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_CAMERANAME QUuid("{918f56b8-b596-482c-8bcc-20b23d4f6a59}")

//--------------------------------------------------------------------------------//
/*!
	@brief	時刻取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_TIME QUuid("{6e7bd164-33d2-4c61-bef4-60aab1967dc4}")

//--------------------------------------------------------------------------------//
/*!
	@brief	時刻取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QDateTime 取得値
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_TIME QUuid("{5e0080b5-2688-4506-a21f-8093855ff181}")

//--------------------------------------------------------------------------------//
/*!
	@brief	時刻設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QDateTime 設定値(ない場合は現在の時刻を取得して設定)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_TIME QUuid("{93eaab02-605e-4dcf-a3fb-0909c47cc11a}")

//--------------------------------------------------------------------------------//
/*!
	@brief	タイムゾーン取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_TIMEZONE QUuid("{cfcb63f2-22bb-4550-be6e-3c560dafaf74}")

//--------------------------------------------------------------------------------//
/*!
	@brief	タイムゾーン取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 QBIC_VALUE_TIMEZONE_GMT*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_TIMEZONE QUuid("{5f397642-c18a-4e08-9495-059c918810c6}")

//--------------------------------------------------------------------------------//
/*!
	@brief	タイムゾーン設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 QBIC_VALUE_TIMEZONE_GMT*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_TIMEZONE QUuid("{dec940ee-6e6b-4eaf-9212-b788406f7008}")

//--------------------------------------------------------------------------------//
/*!
	@brief	起動時LED点灯設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_LED_START QUuid("{700cdc76-85db-4f2e-a274-3a479ab0343a}")

//--------------------------------------------------------------------------------//
/*!
	@brief	起動時LED点灯設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 点灯するならばtrue
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_LED_START QUuid("{e2d753ec-ffec-4ab9-b6f6-0c423e83500e}")

//--------------------------------------------------------------------------------//
/*!
	@brief	起動時LED点灯設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 点灯するならばtrue
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_LED_START QUuid("{7e9fe5a6-f25c-44bf-99bd-ad85622285a3}")

//--------------------------------------------------------------------------------//
/*!
	@brief	LED状態取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_LED QUuid("{7c3eca2e-cbbd-4acf-b3db-a36ad559502d}")

//--------------------------------------------------------------------------------//
/*!
	@brief	LED状態取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 点灯していたらtrue
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_LED QUuid("{3e37c043-a424-41de-9a89-1aefe99fb6b5}")

//--------------------------------------------------------------------------------//
/*!
	@brief	LED設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool　点灯させるならtrue
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_LED QUuid("{a8d0e107-c3de-4aed-8bb5-1d441985e3c2}")

//--------------------------------------------------------------------------------//
/*!
	@brief	コントラストオプティマイザ使用設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_OPTIMIZER QUuid("{5c147b9f-8744-4a6d-8714-947360ef8186}")

//--------------------------------------------------------------------------------//
/*!
	@brief	コントラストオプティマイザ使用設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 使用するならばtrue
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_OPTIMIZER QUuid("{a33f6af8-e3b2-4784-b9f8-892f60d50cd7}")

//--------------------------------------------------------------------------------//
/*!
	@brief	コントラストオプティマイザ使用設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool　使用させるならばtrue
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_OPTIMIZER QUuid("{1d5ca5d6-05c8-4dbd-92a7-87755b8397fa}")

//--------------------------------------------------------------------------------//
/*!
	@brief	給電状態取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_ESTATE QUuid("{44570578-675a-433f-a597-c627919ea5be}")

//--------------------------------------------------------------------------------//
/*!
	@brief	給電状態取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 給電されていればtrue
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_ESTATE QUuid("{bfe73321-d261-4e08-a4b7-cf60bc6bb50c}")

//--------------------------------------------------------------------------------//
/*!
	@brief	電池残量取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_BATTERY QUuid("{10edd1ea-d3d6-49c2-900b-ea03fac73415}")

//--------------------------------------------------------------------------------//
/*!
	@brief	電池残量取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 QBIC_VALUE_BATTERY_STATE_*
			EL_CMD_KEY_PARAM3	quint32 1~100% 百分率
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_BATTERY QUuid("{04a81a2f-442e-4fb5-879a-5b23f010c4ee}")

//--------------------------------------------------------------------------------//
/*!
	@brief	自動電源OFF設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_AUTO_POWEROFF QUuid("{0f1d2161-1206-41af-a711-11a56173400b}")

//--------------------------------------------------------------------------------//
/*!
	@brief	自動電源OFF設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 電源OFFまでの時間,0だと電源OFFしない
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_AUTO_POWEROFF QUuid("{f02654f5-96d3-453c-b87c-7df1842d011b}")

//--------------------------------------------------------------------------------//
/*!
	@brief	自動電源OFF設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 電源OFFまでの時間(60~259200),0だと電源OFFしない
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_AUTO_POWEROFF QUuid("{90f2e593-5fb1-4998-bb7e-8aa45cdbf73b}")

//--------------------------------------------------------------------------------//
/*!
	@brief	電池残量アラーム取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_BATTERY_ALARM	QUuid("{5907435c-4c8a-4118-9602-93396a196f71}")

//--------------------------------------------------------------------------------//
/*!
	@brief	電池残量アラーム取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 設定ONならばtrue
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_BATTERY_ALARM	QUuid("{b27eb079-a50e-4513-b5fb-4fe590216583}")

//--------------------------------------------------------------------------------//
/*!
	@brief	電池残量アラーム設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 設定ONならばtrue
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_BATTERY_ALARM	QUuid("{9cb057f1-fa9c-40c1-8d8f-476683fff7cc}")

//--------------------------------------------------------------------------------//
/*!
	@brief	SD情報取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_SDINFO QUuid("{7df5e53a-9903-4362-b41b-e1f1a57e7b90}")

//--------------------------------------------------------------------------------//
/*!
	@brief	SD情報取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint64 SDカード全容量
			EL_CMD_KEY_PARAM3	quint64 SDカード使用容量
			EL_CMD_KEY_PARAM4	quint32 SDカードファイルフォーマット QBIC_VALUE_SD_FORMAT_*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_SDINFO QUuid("{cbcb30d8-b9eb-4e56-937e-41dc64689399}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ファームウェアバージョン取得要求
	@detals
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_FWVERSION QUuid("{cca73dc9-cb6f-4a1b-96c8-f41df83c17c4}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ファームウェアバージョン取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString バージョン
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_FWVERSION QUuid("{84ce5293-d069-4e3a-92f5-a32e7d83c823}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ用SSID取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_INFRA_SSID QUuid("{6ce7fc83-3907-4feb-ae60-da9b924e162c}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ用SSID取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString SSID
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_INFRA_SSID QUuid("{34d8a66f-1f9f-4011-a999-14aa201b25a0}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ用SSID設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString SSID
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_INFRA_SSID QUuid("{cbcd6f35-1a8f-47ca-91e4-bbec1b35cb58}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ用暗号キー取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_INFRA_KEY QUuid("{e02170d6-e516-415b-938a-902eb1000db0}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ用暗号キー取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString 暗号キー
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_INFRA_KEY QUuid("{52c8d4e3-6827-4892-98ab-223edbe2f4e0}")

//--------------------------------------------------------------------------------//
/*!
	@brief	インフラストラクチャ用暗号キー設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString 暗号キー
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_INFRA_KEY QUuid("{299a9ebd-5c6d-4cea-9e83-d4da5f42128a}")

//--------------------------------------------------------------------------------//
/*!
	@brief	電源OFF
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_POWEROFF QUuid("{2ee73da5-6366-42a8-88c3-a4466d569656}")

//--------------------------------------------------------------------------------//
/*!
	@brief	再起動
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_RESTART QUuid("{badc3b23-f9d4-4b06-ae6c-d0ea198fb4a3}")

//--------------------------------------------------------------------------------//
/*!
	@brief	SDフォーマット
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_FORMAT_SD QUuid("{57ff2ab2-f972-44b1-9fda-2a7215b0b4b7}")

//--------------------------------------------------------------------------------//
/*!
	@brief	工場出荷設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_INIT_SETTING QUuid("{a85992d3-11b2-4b67-83cc-ad12171849b4}")

//--------------------------------------------------------------------------------//
/*!
	@brief	録画操作
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 録画開始するときはtrue,録画停止するときはfalse
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_CTRL_REC QUuid("{82846341-3b50-4c4f-ba53-8f985806ee73}")

//--------------------------------------------------------------------------------//
/*!
	@brief	キャプチャ
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_CAPTURE QUuid("{dab49639-62b3-4339-a390-ced698679efb}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Wi-Fi設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString SSID
			EL_CMD_KEY_PARAM3	QString 暗号キー
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_CONNECT_WIFI QUuid("{fa83014b-5b6c-4335-8170-fbfb0c7050e7}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動的Wi-Fi接続方式変更
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool QBIC_VALUE_WIFI_CONNECT_*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_WIFI_CHANGE QUuid("{3c21e821-0ac0-4be1-9d26-6edf014fca3f}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動的Wi-FiONOFF変更
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool QBIC_VALUE_WIFI_CONNECT_*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_WIFI_SWITCH QUuid("{674b02c7-3fe6-48ed-b2bc-36f154f73cf3}")

//--------------------------------------------------------------------------------//
/*!
	@brief	RFテストモード設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32	mode + enable
			EL_CMD_KEY_PARAM3	qint32	power
			EL_CMD_KEY_PARAM4	qint32	rate
			EL_CMD_KEY_PARAM5	qint32	length
			EL_CMD_KEY_PARAM6	qint32	channel

*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_RF_TESTMODE QUuid("{e99ea8a7-35f2-4b37-8087-4e54bfa7eef7}")

//--------------------------------------------------------------------------------//
/*!
	@brief	RFテストモード開始
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_RF_START QUuid("{87235f88-0267-4d52-929c-5fc106ab2c40}")

//--------------------------------------------------------------------------------//
/*!
	@brief	RFテストモード終了
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_RF_END QUuid("{3ee8f694-7fc9-4e56-9de0-01eef7266b7a}")

//--------------------------------------------------------------------------------//
/*!
	@brief	PE14テスト用パケット送信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool テスト開始するときはtrue,終了するときはfalse
			EL_CMD_KEY_PARAM3	quint8 送信レート
			EL_CMD_KEY_PARAM4	quint8 送信チャネル
			EL_CMD_KEY_PARAM5	quint32 送信バイト数
			EL_CMD_KEY_PARAM6	quint32 送信間隔(usec)
			EL_CMD_KEY_PARAM7	QString MACアドレス
			終了するときはEL_CMD_KEY_PARAM3以降は必要ない
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_MFG_TX QUuid("{d6e92260-5b09-4245-a0b5-0a34f9666500}")

//--------------------------------------------------------------------------------//
/*!
	@brief	PE14テスト用電波送信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool テスト開始するときはtrue,終了するときはfalse
			EL_CMD_KEY_PARAM3	quint8 送信チャネル
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_MFG_ACC QUuid("{96a44b17-c593-45dd-b5c0-9b3c59f7c3fc}")


//--------------------------------------------------------------------------------//
/*!
	@brief	シリアル番号取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_SERIALNO QUuid("{9624a97a-ddf2-4f25-8eac-3876a77df5b0}")

//--------------------------------------------------------------------------------//
/*!
	@brief	シリアル番号取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString シリアル番号
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_SERIALNO QUuid("{eb291049-c0b4-4359-8c87-3995f7a55240}")

//--------------------------------------------------------------------------------//
/*!
	@brief	シリアル番号設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString シリアル番号
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_SERIALNO QUuid("{aa23d661-a9bb-4e6d-a303-b45406455e97}")


//--------------------------------------------------------------------------------//
/*!
	@brief	MACアドレス取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_MACADDRESS QUuid("{9cc5b1a2-beef-4bd5-a499-1a364ccc7115}")

//--------------------------------------------------------------------------------//
/*!
	@brief	MACアドレス取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString MACアドレス
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_MACADDRESS QUuid("{751059e2-918e-4283-a2a6-f9126e1776b3}")


//--------------------------------------------------------------------------------//
/*!
	@brief	機種名取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_MACHINENAME QUuid("{5b92aba6-7c17-47f5-b5cd-b5db074df993}")

//--------------------------------------------------------------------------------//
/*!
	@brief	機種名取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString 機種名
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_MACHINENAME QUuid("{327fc1ff-0479-4b60-90ca-fde541da33e6}")

//--------------------------------------------------------------------------------//
/*!
	@brief	機種名設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString 機種名
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_MACHINENAME QUuid("{794dfca5-79b0-4468-beba-14bf30bd20c5}")


//--------------------------------------------------------------------------------//
/*!
	@brief	アドホック用SSID取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_SSID QUuid("{ae52151b-be4d-4320-99d6-9d7b517b1e02}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アドホック用SSID取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString SSID
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_SSID QUuid("{972f2065-831f-415d-8cdf-44829d7fa3e7}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アドホック用SSID設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString SSID
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_SSID QUuid("{d6afa2b7-5000-4930-934b-d8050b3ec27d}")


//--------------------------------------------------------------------------------//
/*!
	@brief	アドホック暗号キー取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_ADHOCKEY QUuid("{dc68bb99-3144-4917-b25f-eee935ca7b72}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アドホック暗号キー取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString アドホック暗号キー
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_ADHOCKEY QUuid("{a7ae2f81-118e-4482-b245-7a415b781141}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アドホック暗号キー設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString 暗号キー
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_ADHOCKEY QUuid("{a00cafbc-e59b-41df-a439-e9a8eda727c7}")


//--------------------------------------------------------------------------------//
/*!
	@brief	製造日取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_CREATEDAY QUuid("{4342ddbc-a18a-4209-91e1-44e477484961}")

//--------------------------------------------------------------------------------//
/*!
	@brief	製造日取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QDateTime 製造年月日
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_CREATEDAY QUuid("{02a3ad24-dfcd-4214-bc36-efd79fb954bb}")

//--------------------------------------------------------------------------------//
/*!
	@brief	製造日設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QDateTime 設定値(なければ実行した日付を設定)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_CREATEDAY QUuid("{75410f78-b584-4de8-bb42-8d7b1588edc8}")


//--------------------------------------------------------------------------------//
/*!
	@brief	仕向け取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_COUNTRY QUuid("{16fdcd70-a202-4f06-9d66-3ab1770bc9f8}")

//--------------------------------------------------------------------------------//
/*!
	@brief	仕向け取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString 国コード
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_COUNTRY QUuid("{c3fa4fb8-9854-4c38-be03-9cf96e8e8244}")

//--------------------------------------------------------------------------------//
/*!
	@brief	仕向け設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString 国コード
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_COUNTRY QUuid("{030e5110-0fa9-436a-8432-4d3e206619c2}")


//--------------------------------------------------------------------------------//
/*!
	@brief	レンズ情報取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_LENSINFO QUuid("{50c3cc3f-5d57-4902-8afd-f09bef269e58}")

//--------------------------------------------------------------------------------//
/*!
	@brief	レンズ情報取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString レンズ情報
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_LENSINFO QUuid("{cf80f4b6-24c5-497d-918b-5338d40af6b3}")

//--------------------------------------------------------------------------------//
/*!
	@brief	レンズ設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString レンズ情報
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_LENSINFO QUuid("{1a121728-9553-4b5b-812a-c622e046f00a}")


//--------------------------------------------------------------------------------//
/*!
	@brief	Uuid取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_UUID QUuid("{3CCE07C9-2184-4b1d-AA78-CA6C39CB7E5C}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Uuid取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString レンズ情報
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_UUID QUuid("{B2C98803-5747-4c2d-B717-177C983C3AF8}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Uuid設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString レンズ情報
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_UUID QUuid("{A2D452ED-12C0-47fb-9A63-78C1FD09E281}")

//--------------------------------------------------------------------------------//
/*!
	@brief	D専用シリアル番号設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString シリアル番号
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_DQBIC_SERIAL QUuid("{0B653A9D-F0A0-4167-862B-7BD388ADAAFA}")



//--------------------------------------------------------------------------------//
/*!
	@brief	軸ずれ検査実行
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 閾値(なければデフォルト値)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_EXEC_ALIGNMENT QUuid("{389e417a-5de4-4f5c-8724-cf332663860a}")

//--------------------------------------------------------------------------------//
/*!
	@brief	解像度検査実行
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 閾値(なければデフォルト値)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_EXEC_RESOLUTION QUuid("{bd158212-f5d8-43e4-8304-6714dc7c7364}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ケラレ検査実行
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 範囲(なければデフォルト値)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_EXEC_VIGNETTING QUuid("{fd48aacf-0fba-4444-98f9-4454536a819b}")

//--------------------------------------------------------------------------------//
/*!
	@brief	AWB検査実行
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 範囲(なければデフォルト値)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_EXEC_AWB QUuid("{a7927d7e-13f0-48f1-a637-f1229093aed0}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ごみ検査実行
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 閾値(なければデフォルト値)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_EXEC_DUST QUuid("{58974d72-306f-4b56-9f65-067028c440b8}")

//--------------------------------------------------------------------------------//
/*!
	@brief	画素欠陥検査実行
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 閾値(なければデフォルト値)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_EXEC_DOTERROR QUuid("{f1ed97dd-cbfa-432f-b209-1a0d3e0c83e8}")

//--------------------------------------------------------------------------------//
/*!
	@breif	RAM検査実行
	@detals
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_EXEC_RAM QUuid("{64ae8c72-8008-4b99-9278-f83f13410f1f}")

//--------------------------------------------------------------------------------//
/*!
	@breif	RAWデータ保存
	@detals
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SAVE_RAWDATA QUuid("{90ea5357-80ea-49e7-9631-e21ff89a01d3}")

//--------------------------------------------------------------------------------//
/*!
	@breif	YCデータ保存
	@detals
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SAVE_YCDATA QUuid("{858285f1-55aa-48e1-a888-6a93685287e9}")

//--------------------------------------------------------------------------------//
/*!
	@breif	調整データ保存
	@detals
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SAVE_ADJUSTDATA QUuid("{94964655-6338-4fae-af17-80e3cd5f5ac8}")

//--------------------------------------------------------------------------------//
/*!
	@breif	AdjustFlag設定
	@detals
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 Adjustflag値
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_ADJUSTFLAG QUuid("{ab845f73-cdb6-46a3-8e3b-29c2102ce796}")

//--------------------------------------------------------------------------------//
/*!
	@breif	AdjustFlag取得要求
	@detals
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_ADJUSTFLAG QUuid("{69b9054a-3bb1-4ebb-b412-5ff7974df8a2}")

//--------------------------------------------------------------------------------//
/*!
	@breif	AdjustFlag取得返信
	@detals
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 AdjustFlag値
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_ADJUSTFLAG QUuid("{d19201b9-cd1d-475a-a195-ea8d3ba77423}")

//--------------------------------------------------------------------------------//
/*!
	@brief	AEMode
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_EXEC_AEMODE QUuid("{3A389919-B7F0-4ec2-BC43-ED44CC6B7BDD}")

//--------------------------------------------------------------------------------//
/*!
	@brief	AELock
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_EXEC_AELOCK QUuid("{82E15B39-754C-4951-A954-FE1595FC3CB4}")

//--------------------------------------------------------------------------------//
/*!
	@breif	Aging
	@detals
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_EXEC_AGING QUuid("{200A86E9-ADD2-4b1b-8DCA-22903B97BC7F}")

//--------------------------------------------------------------------------------//
/*!
	@brief	JPEG要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_REQ_JPEG QUuid("{738e6308-44a9-40e5-9843-be6f3cfc210c}")

//--------------------------------------------------------------------------------//
/*!
	@brief	音声要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_REQ_AUDIO QUuid("{14e6475a-db0a-4f48-a040-e0852997005b}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ファームウェアアップデート
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QByteArray ファームデータ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_EXEC_FWUPDATEDATA QUuid("{41f721f2-8cc7-480c-9e77-ce94c69b9210}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ファームウェアアップデート実行
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 強制書き込みならtrue
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_EXEC_FWUPDATE QUuid("{ade54208-354a-4871-b677-b22be72788b4}")

//--------------------------------------------------------------------------------//
/*!
	@brief	画像データ通知
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QImage　画像
*/
//--------------------------------------------------------------------------------//
#define USB_CMD_RES_JPEG QUuid("{6d49cfe5-c856-4e8d-aa92-d50e808f70ac}")

//--------------------------------------------------------------------------------//
/*!
	@brief	音声データ通知
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QByteArray 音声データ
*/
//--------------------------------------------------------------------------------//
#define USB_CMD_RES_AUDIO QUuid("{fe39c92e-d28c-404d-98ec-fc62ce9a955d}")


//--------------------------------------------------------------------------------//
/*!
	@brief	Wi-Fi対応国設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString	対応国コード
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_WIFI_COUNTRY QUuid("{3a5a2bb2-33eb-4e33-9b7a-a692c7673520}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Wi-Fi対応国要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_WIFI_COUNTRY QUuid("{75e7a1f9-dca0-496e-b974-071a0a42a49d}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Wi-Fi対応国返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString	対応国コード
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_WIFI_COUNTRY QUuid("{59d4a0b0-3afd-4ce8-b53c-500a058a756a}")


//--------------------------------------------------------------------------------//
/*!
	@brief	アドホックセキュリティ種別設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_ADHOC_SECURE QUuid("{2ab1402c-9c03-4bc9-8567-01739294cf6d}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アドホックセキュリティ種別要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_ADHOC_SECURE QUuid("{3c51ae6c-ed66-4f93-aa98-eca21ab0b868}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アドホックセキュリティ種別返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_ADHOC_SECURE QUuid("{3a05f052-c92b-467e-b29c-91336c7887d3}")


//--------------------------------------------------------------------------------//
/*!
	@brief	RTSPポート番号設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 554or(1024~65535)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_RTSP_PORT QUuid("{25fdaf07-b6c0-44d4-ad1a-c8f46b2e1825}")

//--------------------------------------------------------------------------------//
/*!
	@brief	RTSPポート番号要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_RTSP_PORT QUuid("{daac6fa5-cdcd-4679-844d-cf82e70f24a7}")

//--------------------------------------------------------------------------------//
/*!
	@brief	RTSPポート番号返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 554or(1024~65535)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_RTSP_PORT QUuid("{b1abbecc-de12-43a3-b2ff-fc173d88c046}")


//--------------------------------------------------------------------------------//
/*!
	@brief	STUNサーバーアドレス設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString STUNサーバーアドレス
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_STUN_SERVER QUuid("{895e652b-a883-4018-b1a2-fb22c3d4387e}")

//--------------------------------------------------------------------------------//
/*!
	@brief	STUNサーバーアドレス要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_STUN_SERVER QUuid("{57285e3e-0232-41a2-977b-505bfe477b56}")

//--------------------------------------------------------------------------------//
/*!
	@brief	STUNサーバーアドレス返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString STUNサーバーアドレス
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_STUN_SERVER QUuid("{2cc16579-60da-40d7-8f34-2c5a9575b7b2}")


//--------------------------------------------------------------------------------//
/*!
	@brief	プライマリDNS取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_PRIMARY_DNS QUuid("{c211ce1a-afd8-48fd-9698-296151025a3d}")

//--------------------------------------------------------------------------------//
/*!
	@brief	プライマリDNS取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString プライマリDNSサーバーアドレス(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_PRIMARY_DNS QUuid("{7ca7554d-7909-47a8-a64b-5c25da706385}")

//--------------------------------------------------------------------------------//
/*!
	@brief	プライマリDNS設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString プライマリDNSサーバーアドレス(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_PRIMARY_DNS QUuid("{b55b9958-cbf5-43e2-9a33-f4f7d49c5627}")


//--------------------------------------------------------------------------------//
/*!
	@brief	セカンダリDNS取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_SECONDARY_DNS QUuid("{a3119092-5496-44ad-b215-588db84f2bee}")

//--------------------------------------------------------------------------------//
/*!
	@brief	セカンダリDNS取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString セカンダリDNSサーバーアドレス(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_SECONDARY_DNS QUuid("{46352d63-3121-46ee-8ad6-0f882cac72db}")

//--------------------------------------------------------------------------------//
/*!
	@brief	セカンダリDNS設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString セカンダリDNSサーバーアドレス(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_SECONDARY_DNS QUuid("{e6eb7713-6bc1-41f5-b775-f53154aedce4}")


//--------------------------------------------------------------------------------//
/*!
	@brief	Wi-Fi OnOff取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_WIFI_ONOFF QUuid("{d7ca46d5-8130-4d64-9d08-5fedd12f0a9c}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Wi-Fi OnOff取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_WIFI_ONOFF QUuid("{6d68a1fe-182b-411d-be79-3ff6b76b4bc0}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Wi-Fi OnOff設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_WIFI_ONOFF QUuid("{6b79191a-f725-4384-92cb-6eebfda60897}")


//--------------------------------------------------------------------------------//
/*!
	@brief	自動Wi-FiOFF設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_AUTO_WIFIOFF QUuid("{8798f506-807d-4f5a-8994-9c0e33a9b896}")

//--------------------------------------------------------------------------------//
/*!
	@brief	自動Wi-FiOFF設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 Wi-FiOFFまでの時間,0だとWi-FiOFFしない
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_AUTO_WIFIOFF QUuid("{f2be8b6d-4ce8-415d-9919-b3aa7e443bf8}")

//--------------------------------------------------------------------------------//
/*!
	@brief	自動Wi-FiOFF設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 Wi-FiOFFまでの時間(60~259200),0だとWi-FiOFFしない
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_AUTO_WIFIOFF QUuid("{c584a260-58d5-434c-adbf-be7abae0c646}")

//--------------------------------------------------------------------------------//
/*!
	@brief	画質設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_IMAGE_QUARITY QUuid("{7b5a3b37-a8ab-4b48-9afa-d4187679385e}")

//--------------------------------------------------------------------------------//
/*!
	@brief	画質設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 γテーブル番号(0~4)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_IMAGE_QUARITY QUuid("{b3b2ab47-196c-4511-91d3-4b7209ff8d24}")

//--------------------------------------------------------------------------------//
/*!
	@brief	画質設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	quint32 γテーブル番号(0~4)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_IMAGE_QUARITY QUuid("{6dfd1983-3242-4ca6-a70e-c831aeded0c6}")

//--------------------------------------------------------------------------------//
/*!
	@brief	警戒モード中LED設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_LED_ON_SECURE QUuid("{1B27E1DA-A5E1-4fc1-89DE-DBA558A19B97}")

//--------------------------------------------------------------------------------//
/*!
	@brief	警戒モード中LED設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool ON/OFF
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_LED_ON_SECURE QUuid("{65C021F5-2BAB-4580-980E-71DED13A3302}")

//--------------------------------------------------------------------------------//
/*!
	@brief	警戒モード中LED設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool ON/OFF
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_LED_ON_SECURE QUuid("{D5A3A7CC-14F2-4a03-ABFA-24B65E4783B0}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュールON/OFF設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_SCHE_ONOFF QUuid("{60C76B5E-4E63-40bb-9317-EEFB7F9AB5DC}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュールON/OFF設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool ON/OFF
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_SCHE_ONOFF QUuid("{2B8C77D2-5A81-4e5c-9D1A-97E0440ABF22}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュールON/OFF設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool ON/OFF
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_SCHE_ONOFF QUuid("{E0B59DD4-F167-408c-8FE3-8EAEA4BE09C3}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュール設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_SCHE_SETTING QUuid("{1544057D-5AC5-4066-BE3B-6037B9EA58D1}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュール設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	ScheduleSettings	スケジュールリスト
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_SCHE_SETTING QUuid("{E7503B6A-E98D-4401-B0EC-4765B383BB0C}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュール設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_WEEKDAY_*	曜日
			EL_CMD_KEY_PARAM3	bool					有効/無効
			EL_CMD_KEY_PARAM4	QTime					開始時刻
			EL_CMD_KEY_PARAM5	QTime					終了時刻
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_SCHE_SETTING QUuid("{BDC84E4E-B278-45bc-8901-46976FAAE5EC}")

//--------------------------------------------------------------------------------//
/*!
	@brief	起動時モード設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_STARTMODE QUuid("{FE523DCE-3DC8-4be3-90C6-1C6829B026FD}")

//--------------------------------------------------------------------------------//
/*!
	@brief	起動時モード設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_STARTMODE_*	モード
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_STARTMODE QUuid("{4E339A7F-34DB-4635-A120-7D2E8B939EF6}")

//--------------------------------------------------------------------------------//
/*!
	@brief	起動時モード設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_STARTMODE_*	モード
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_STARTMODE QUuid("{FBA6FD31-3B68-482a-BCB1-6059218047AF}")

//--------------------------------------------------------------------------------//
/*!
	@brief	警戒時キーロック設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_SECURE_KEYLOCK QUuid("{1CA63351-6D60-438f-842E-8A69BB8E2273}")

//--------------------------------------------------------------------------------//
/*!
	@brief	警戒時キーロック設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_KEYLOCK_* ON/OFF
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_SECURE_KEYLOCK QUuid("{23C9A60C-572B-47e1-B0B7-8FF9AA069830}")

//--------------------------------------------------------------------------------//
/*!
	@brief	警戒時キーロック設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_KEYLOCK_* ON/OFF
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_SECURE_KEYLOCK QUuid("{DF80C5D7-7E98-4200-8CA1-5A4E11C983F9}")

//--------------------------------------------------------------------------------//
/*!
	@brief	DDNSサーバアドレス設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_DDNS_ADDRESS QUuid("{E8ADECA7-F2C3-4fd0-B197-7A5654BA6938}")

//--------------------------------------------------------------------------------//
/*!
	@brief	DDNSサーバアドレス設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString	URI or IPv4アドレス
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_DDNS_ADDRESS QUuid("{E054B815-5F2A-4246-8338-B38A0AE85434}")

//--------------------------------------------------------------------------------//
/*!
	@brief	DDNSサーバアドレス設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString	URI or IPv4アドレス
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_DDNS_ADDRESS QUuid("{6798F951-F21D-4ee7-B00C-EBF73935D977}")

//--------------------------------------------------------------------------------//
/*!
	@brief	映像180度回転設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_ROTATE180 QUuid("{4ED410FB-9D64-4f6d-B6DD-1F6B99DF1F63}")

//--------------------------------------------------------------------------------//
/*!
	@brief	映像180度回転設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_ROTATE_*	回転設定有効/無効
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_ROTATE180 QUuid("{9D880E75-1459-4c65-9382-49706AC8FDC3}")

//--------------------------------------------------------------------------------//
/*!
	@brief	映像180度回転設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_ROTATE_*	回転設定有効/無効
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_ROTATE180 QUuid("{CB8F91A8-20D1-482a-8485-9C3A976C31E0}")

//--------------------------------------------------------------------------------//
/*!
	@brief	現在のセキュリティ動作モード設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_SECURE_CURR QUuid("{C8ED62DF-740D-47e8-B3CB-3757416B00A0}")

//--------------------------------------------------------------------------------//
/*!
	@brief	現在のセキュリティ動作モード設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32　QBIC_VALUE_MODE_*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_SECURE_CURR QUuid("{E6B92E4D-E308-407f-A9D8-099B52AB24E0}")


//--------------------------------------------------------------------------------//
/*!
	@brief	現在のスケジュールモード取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_SCHE_CURRENT QUuid("{90142A75-EC9D-4c56-8FE3-422374DBE3D6}")

//--------------------------------------------------------------------------------//
/*!
	@brief	現在のスケジュールモード取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_SCHE_* スケジュール実行状態
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_SCHE_CURRENT QUuid("{4E61EF4E-CF3C-405d-8E84-4E46D2149A1A}")

//--------------------------------------------------------------------------------//
/*!
	@brief	現在のセキュリティ動作モード設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 QBIC_VALUE_MODE_*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_EXEC_SECURE_CURR QUuid("{0BDB316A-ADA5-4111-8A7A-7B64DD185B8A}")

//--------------------------------------------------------------------------------//
/*!
	@brief	警戒モード中のスケジュール設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_SCHE_*　スケジュール実行状態
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_EXEC_SCHE_SECURE QUuid("{CB65080C-A9F8-4e49-88B5-67CF31581900}")

//--------------------------------------------------------------------------------//
/*!
	@brief	HTTPポート番号設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 80or(1024~65535)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_HTTP_PORT QUuid("{3E294B16-F12C-44d0-8BD8-EDBE1D52BDFB}")


//--------------------------------------------------------------------------------//
/*!
	@brief	HTTPポート番号要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_HTTP_PORT QUuid("{7FA78FC7-14F4-4257-9564-205922BE0C73}")

//--------------------------------------------------------------------------------//
/*!
	@brief	HTTPポート番号返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 80or(1024~65535)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_HTTP_PORT QUuid("{FBDDAB5B-7A46-4c62-8BA1-E08E58A873D9}")

//--------------------------------------------------------------------------------//
/*!
	@brief	CTRLサーバURI設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_CTRL_SERVER QUuid("{EC54326D-4099-40f9-9B9A-9BD8D69C210B}")

//--------------------------------------------------------------------------------//
/*!
	@brief	CTRLサーバURI設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString	URI or IPv4アドレス
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_CTRL_SERVER QUuid("{47378D66-DD79-4504-BD69-555B07DA4884}")

//--------------------------------------------------------------------------------//
/*!
	@brief	CTRLサーバURI設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString	URI or IPv4アドレス
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_CTRL_SERVER QUuid("{B90B4C12-BA04-43bd-B7C9-B2FFAC94F418}")

//--------------------------------------------------------------------------------//
/*!
	@brief	タイムスタンプオンオフ設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_TIMESTAMP_ON QUuid("{16AE833C-47C4-43cf-B984-2CA0C1A3B13B}")

//--------------------------------------------------------------------------------//
/*!
	@brief	タイムスタンプオンオフ設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_TIMESTAMP_ON QUuid("{CBA02141-EA28-476c-A686-65A5B30BD452}")

//--------------------------------------------------------------------------------//
/*!
	@brief	タイムスタンプオンオフ設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_TIMESTAMP_ON QUuid("{EB0237A4-7127-436c-8C73-01300B276C12}")


//--------------------------------------------------------------------------------//
/*!
	@brief	タイムスタンプ位置設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_TIMESTAMP_POS QUuid("{A92BA64B-A87B-4b9f-8655-538329D73FF0}")

//--------------------------------------------------------------------------------//
/*!
	@brief	タイムスタンプ位置設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_TIMESTAMP_POS*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_TIMESTAMP_POS QUuid("{2A4FF122-A9F0-490f-8D54-CF275A368F94}")

//--------------------------------------------------------------------------------//
/*!
	@brief	タイムスタンプ位置設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_TIMESTAMP_POS*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_TIMESTAMP_POS QUuid("{1D43923F-773C-47b4-A88A-8A85353D68BC}")


//--------------------------------------------------------------------------------//
/*!
	@brief	タイムスタンプフォーマット設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_TIMESTAMP_FORM QUuid("{AB48A851-4317-4782-B8F5-744A03D26999}")

//--------------------------------------------------------------------------------//
/*!
	@brief	タイムスタンプフォーマット設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_TIMESTAMP_FORM*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_TIMESTAMP_FORM QUuid("{64D54D95-A28B-4f34-B287-46723AB6E201}")

//--------------------------------------------------------------------------------//
/*!
	@brief	タイムスタンプフォーマット設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_TIMESTAMP_FORM*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_TIMESTAMP_FORM QUuid("{781C196C-9C02-46e9-AB15-387A9A19E6DD}")


//--------------------------------------------------------------------------------//
/*!
	@brief	品質プリセット設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_QUALITY_PRESET QUuid("{CA0C6221-1F92-45a3-A629-1F6E7CF8A467}")

//--------------------------------------------------------------------------------//
/*!
	@brief	品質プリセット設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_QUALITY_PRESET*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_QUALITY_PRESET QUuid("{43100B70-118B-4462-9F4A-8C901EFF860B}")

//--------------------------------------------------------------------------------//
/*!
	@brief	品質プリセット設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_QUALITY_PRESET*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_QUALITY_PRESET QUuid("{BA6906D1-BA25-458a-8EA2-EE183A81C837}")


//--------------------------------------------------------------------------------//
/*!
	@brief	音声上りポート設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_AUDIO_UPPORT QUuid("{F0852922-3BDC-4b4b-9B79-7CAA0C2A98DE}")

//--------------------------------------------------------------------------------//
/*!
	@brief	音声上りポート設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32　1024以上
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_AUDIO_UPPORT QUuid("{2B2148EA-B13F-4945-98EF-C671FFD165D2}")

//--------------------------------------------------------------------------------//
/*!
	@brief	音声上りポート設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32　1024以上
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_AUDIO_UPPORT QUuid("{4ACFF480-9DD8-4885-8A08-19B198AA8091}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュール種類設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_SCHE_SELECT QUuid("{8E17404A-A727-4b39-8435-4F6F475DB8A6}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュール種類設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 ON/時間/周期
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_SCHE_SELECT QUuid("{A9084D4E-3E47-4faf-98B8-BBD10127FACF}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュール種類設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32　ON/時間/周期
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_SCHE_SELECT QUuid("{FCB2626E-C3DD-433d-9CF2-1AD8C939F044}")

//--------------------------------------------------------------------------------//
/*!
	@brief	起動時操作ロック設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_START_LOCK QUuid("{12F16022-2D2A-4d0d-BCA4-89A9D674FDB4}")

//--------------------------------------------------------------------------------//
/*!
	@brief	起動時操作ロック設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool OFF/ON
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_START_LOCK QUuid("{90A7BF5E-CDA7-4761-86C7-2B6DCCE3C6AB}")

//--------------------------------------------------------------------------------//
/*!
	@brief	起動時操作ロック設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool　OFF/ON
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_START_LOCK QUuid("{366DAC5E-D95E-4e4e-BEF2-808CC8D2106A}")


//--------------------------------------------------------------------------------//
/*!
	@brief	遠隔最大録画時間設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_REMOTE_RECTIME QUuid("{38440127-6470-4f29-B6AE-39FEB23AF866}")

//--------------------------------------------------------------------------------//
/*!
	@brief	遠隔最大録画時間設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-5
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_REMOTE_RECTIME QUuid("{67E2B9D7-1404-46b1-8CBE-E6EEEFF6D2B2}")

//--------------------------------------------------------------------------------//
/*!
	@brief	遠隔最大録画時間設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-5
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_REMOTE_RECTIME QUuid("{927DA43E-0A1F-4b17-83CF-46BDAFC098D5}")


//--------------------------------------------------------------------------------//
/*!
	@brief	本体最大録画時間設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_REC_TIME QUuid("{BA7339D3-BFFC-4644-97D4-AB5EE92BC7D9}")

//--------------------------------------------------------------------------------//
/*!
	@brief	本体最大録画時間設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-30
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_REC_TIME QUuid("{5CF5DB3A-6DAA-40b5-BE96-33813F10B5B1}")

//--------------------------------------------------------------------------------//
/*!
	@brief	本体最大録画時間設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-30
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_REC_TIME QUuid("{3ABCC02D-BF9D-409e-A500-87598C7F7336}")


//--------------------------------------------------------------------------------//
/*!
	@brief	プレアラーム設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_PRE_ALARM QUuid("{A1C9A1EF-C59F-4d8d-A74E-C133CBECCFA9}")

//--------------------------------------------------------------------------------//
/*!
	@brief	プレアラーム設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-3(秒)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_PRE_ALARM QUuid("{E1453EB0-769E-49ac-A2FD-13F57493F760}")

//--------------------------------------------------------------------------------//
/*!
	@brief	プレアラーム設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-3(秒)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_PRE_ALARM QUuid("{05D092AF-FDBB-4a4b-8217-5E1CFD931AAE}")


//--------------------------------------------------------------------------------//
/*!
	@brief	動体検知エリア設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_MOTION_AREA QUuid("{3E8B3B5E-17E6-4e16-86F3-3B268105C3ED}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動体検知エリア設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QByteArray
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_MOTION_AREA QUuid("{414A6D7B-1571-4179-B39E-7FD19D7C6CDC}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動体検知エリア設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QByteArray
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_MOTION_AREA QUuid("{51DE14EA-4E70-439d-85D0-494B9057AA8D}")


//--------------------------------------------------------------------------------//
/*!
	@brief	動体検知感度設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_MOTION_SENSOR QUuid("{FD37381B-D49F-45f0-BE25-C086901C77EA}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動体検知感度設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-15
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_MOTION_SENSOR QUuid("{35F5E01E-3982-4e00-AA4D-F4D7B4D282EF}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動体検知感度設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-15
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_MOTION_SENSOR QUuid("{3C77FE30-379E-442e-B36F-1A22C0587407}")


//--------------------------------------------------------------------------------//
/*!
	@brief	不動体検知感度設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_UNMOTION_SENS QUuid("{BD38D9FC-E356-4de4-8496-8A39E00D4948}")

//--------------------------------------------------------------------------------//
/*!
	@brief	不動体検知感度設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-15
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_UNMOTION_SENS QUuid("{C35D5341-D271-4b4c-8A9D-3F201C279AF0}")

//--------------------------------------------------------------------------------//
/*!
	@brief	不動体検知感度設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-15
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_UNMOTION_SENS QUuid("{2A4D77F4-64A6-4689-B9A4-ABCD9AB25C4B}")


//--------------------------------------------------------------------------------//
/*!
	@brief	音量設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_VOLUME_LEVEL QUuid("{7CE8F9B0-9D07-4ab2-AE2A-E9D61BE3B0B5}")

//--------------------------------------------------------------------------------//
/*!
	@brief	音量設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-5
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_VOLUME_LEVEL QUuid("{3C74B15F-94CC-4cc7-86AF-6006AA344141}")

//--------------------------------------------------------------------------------//
/*!
	@brief	音量設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-5
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_VOLUME_LEVEL QUuid("{D9355C4F-F9F4-4e95-A480-9A51CEEFD442}")


//--------------------------------------------------------------------------------//
/*!
	@brief	デジカメモードシャッター音設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_DIGCAM_SHUTTER QUuid("{99E8BB68-F4CD-4d73-9377-0CC474E54535}")

//--------------------------------------------------------------------------------//
/*!
	@brief	デジカメモードシャッター音設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_SHUTTER_*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_DIGCAM_SHUTTER QUuid("{0025E8F6-42D6-4f34-AF83-897564A08040}")

//--------------------------------------------------------------------------------//
/*!
	@brief	デジカメモードシャッター音設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_SHUTTER_*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_DIGCAM_SHUTTER QUuid("{6254980A-D7F1-4906-AA94-7416713E6A4B}")


//--------------------------------------------------------------------------------//
/*!
	@brief	警戒モードシャッター音設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_SECURE_SHUTTER QUuid("{5DFA858C-9320-4466-A07D-CFB43A3C1252}")

//--------------------------------------------------------------------------------//
/*!
	@brief	警戒モードシャッター音設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_SHUTTER_*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_SECURE_SHUTTER QUuid("{569F1420-3147-4f54-84D5-E9942D1F847C}")

//--------------------------------------------------------------------------------//
/*!
	@brief	警戒モードシャッター音設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_SHUTTER_*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_SECURE_SHUTTER QUuid("{795DA759-C560-4e4b-ABCC-5F7B3886499A}")


//--------------------------------------------------------------------------------//
/*!
	@brief	見守りモードシャッター音設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_WATCH_SHUTTER QUuid("{00BEF915-05C0-4e5a-B0BB-264F3997A5BA}")

//--------------------------------------------------------------------------------//
/*!
	@brief	見守りモードシャッター音設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_SHUTTER_*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_WATCH_SHUTTER QUuid("{A7A6A960-39AB-4ce7-8B43-F962679B9013}")

//--------------------------------------------------------------------------------//
/*!
	@brief	見守りモードシャッター音設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_SHUTTER_*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_WATCH_SHUTTER QUuid("{41AF0F87-1828-47a0-98B9-C6DAF98B63BD}")


//--------------------------------------------------------------------------------//
/*!
	@brief	ドアホンモードシャッター音設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_DOOR_SHUTTER QUuid("{BCAF2D74-EEFC-4e7b-9925-E672A7638DCA}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ドアホンモードシャッター音設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_SHUTTER_*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_DOOR_SHUTTER QUuid("{B5D1DFB8-3608-4418-BE8C-498D3132645D}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ドアホンモードシャッター音設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_SHUTTER_*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_DOOR_SHUTTER QUuid("{93511B07-6345-4357-AC80-6C159C1FD197}")


//--------------------------------------------------------------------------------//
/*!
	@brief	連続モードシャッター音設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_CONT_SHUTTER QUuid("{D0F3628C-4C71-4848-B438-80BCE44A44C7}")

//--------------------------------------------------------------------------------//
/*!
	@brief	連続モードシャッター音設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_SHUTTER_*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_CONT_SHUTTER QUuid("{1376BE6D-95DF-45de-8BEC-FA4A02D005F7}")

//--------------------------------------------------------------------------------//
/*!
	@brief	連続モードシャッター音設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_SHUTTER_*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_CONT_SHUTTER QUuid("{3164516C-097F-4771-9E90-1305674F39ED}")


//--------------------------------------------------------------------------------//
/*!
	@brief	QR読み取りモード無操作終了設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_QR_NO_OPE QUuid("{92CB479C-6AD0-43f6-876A-197C7F58B0AF}")

//--------------------------------------------------------------------------------//
/*!
	@brief	QR読み取りモード無操作終了設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-10
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_QR_NO_OPE QUuid("{0CCB27A6-FA5D-4be5-B1FB-849BE47CF72A}")

//--------------------------------------------------------------------------------//
/*!
	@brief	QR読み取りモード無操作終了設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-10
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_QR_NO_OPE QUuid("{C26843DB-D4E4-472a-9E77-20216E35BEDF}")


//--------------------------------------------------------------------------------//
/*!
	@brief	見守りモード見守り間隔設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_WATCH_INTERVAL QUuid("{631E7D85-2B55-49d1-8AE2-8B8297A96CA5}")

//--------------------------------------------------------------------------------//
/*!
	@brief	見守りモード見守り間隔設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-30
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_WATCH_INTERVAL QUuid("{943D5963-309F-4833-8D2D-C3B25A107BAE}")

//--------------------------------------------------------------------------------//
/*!
	@brief	見守りモード見守り間隔設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-30
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_WATCH_INTERVAL QUuid("{2ACDEDE0-AD38-4346-9B33-724A0FFB701F}")


//--------------------------------------------------------------------------------//
/*!
	@brief	ドアホンモード動体検知間隔設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_DOOR_INTERVAL QUuid("{3203FADA-DB8C-41c3-874B-25B51AF0C526}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ドアホンモード動体検知間隔設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-60
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_DOOR_INTERVAL QUuid("{D8FFA931-347C-49df-9770-96935FC5981D}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ドアホンモード動体検知間隔設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-60
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_DOOR_INTERVAL QUuid("{6FDB7C12-F6FD-45bb-BEFE-2BE00476AF57}")



//--------------------------------------------------------------------------------//
/*!
	@brief	アップロード可否設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_UPLOAD_ONOFF QUuid("{7F984A8C-ED7A-49fb-B09D-A34F6B2CF514}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アップロード可否設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_UPLOAD_ONOFF QUuid("{0F217D49-B9C9-4544-B44A-0D722314069D}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アップロード可否設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_UPLOAD_ONOFF QUuid("{04EBF370-272B-4aab-BF96-1485EBAB614B}")


//--------------------------------------------------------------------------------//
/*!
	@brief	アップロード後ファイル削除設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_UPLOAD_DELETE QUuid("{25447415-4A52-42db-BBE9-291646D3E863}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アップロード後ファイル削除設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_UPLOAD_DELETE QUuid("{BFE93136-B906-43e0-AFA4-A5BB911C5276}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アップロード後ファイル削除設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_UPLOAD_DELETE QUuid("{0C861F97-224E-4c22-9698-FA3E7652A5C8}")



//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュール周期設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_SCHE_CYCLE QUuid("{04CC799E-4489-4a39-B8B1-A395851FC145}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュール周期設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_CYCLE_*
			EL_CMD_KEY_PARAM3	qint32 1-1439
			EL_CMD_KEY_PARAM4	qint32 5-30
			EL_CMD_KEY_PARAM5	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_SCHE_CYCLE QUuid("{885838FD-FDDA-4c82-925A-3594536881F5}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュール周期設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_CYCLE_*
			EL_CMD_KEY_PARAM3	qint32 1-1439
			EL_CMD_KEY_PARAM4	qint32 5-30
			EL_CMD_KEY_PARAM5	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_SCHE_CYCLE QUuid("{9F00B352-BE4A-4291-934D-F2F1F9F4BEE0}")


//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュールモード等設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-20
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_SCHE_DAY_TIME QUuid("{C9F4FBC8-376E-420c-BF0C-87342CA95718}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュールモード等設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-20
			EL_CMD_KEY_PARAM3	QBIC_VALUE_WEEKDAY_*	曜日
			EL_CMD_KEY_PARAM4	bool					有効/無効
			EL_CMD_KEY_PARAM5	QTime					開始時刻
			EL_CMD_KEY_PARAM6	QTime					終了時刻
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_SCHE_DAY_TIME QUuid("{2DF13F38-79FD-40b3-92EE-1D6B6A2EBCE6}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュールモード等設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-20
			EL_CMD_KEY_PARAM3	QBIC_VALUE_WEEKDAY_*	曜日
			EL_CMD_KEY_PARAM4	bool					有効/無効
			EL_CMD_KEY_PARAM5	QTime					開始時刻
			EL_CMD_KEY_PARAM6	QTime					終了時刻
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_SCHE_DAY_TIME QUuid("{FF0E3746-F990-4924-A641-3110413161E3}")


//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュールモード等設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-20
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_SCHE_DAY_MODE QUuid("{D83E325D-31F8-49ca-9194-D18ADB727C7E}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュールモード等設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-20
			EL_CMD_KEY_PARAM3	QBIC_VALUE_SCHE_MODE_*
			EL_CMD_KEY_PARAM4	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_SCHE_DAY_MODE QUuid("{F1BB53B7-C04A-4590-B1B0-AFA9C23FF941}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュールモード等設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0-20
			EL_CMD_KEY_PARAM3	QBIC_VALUE_SCHE_MODE_*
			EL_CMD_KEY_PARAM4	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_SCHE_DAY_MODE QUuid("{D03E2514-2937-4709-880F-1B82085B3DE4}")


//--------------------------------------------------------------------------------//
/*!
	@brief	録画パラメータ設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-3
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_REC_PARAMETER QUuid("{C75643FA-EC2B-4591-ADA4-8387B13B0080}")

//--------------------------------------------------------------------------------//
/*!
	@brief	録画パラメータ設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-3
			EL_CMD_KEY_PARAM3	qint32 1-30
			EL_CMD_KEY_PARAM4	quint32
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_REC_PARAMETER QUuid("{27546812-C9AB-4546-984D-3838E8FBC226}")

//--------------------------------------------------------------------------------//
/*!
	@brief	録画パラメータ設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-3
			EL_CMD_KEY_PARAM3	qint32 1-30
			EL_CMD_KEY_PARAM4	quint32
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_REC_PARAMETER QUuid("{023F1C3E-058B-4f70-91B9-05E27EA1A7DC}")


//--------------------------------------------------------------------------------//
/*!
	@brief	ライブパラメータ設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-3
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_LIVE_PARAMETER QUuid("{B9BAE4CE-0510-4ad2-B27F-E18404664B31}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ライブパラメータ設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-3
			EL_CMD_KEY_PARAM3	qint32 1-30
			EL_CMD_KEY_PARAM4	quint32
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_LIVE_PARAMETER QUuid("{FAAEA10E-6988-4934-A2CB-99EED299A1AF}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ライブパラメータ設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-3
			EL_CMD_KEY_PARAM3	qint32 1-30
			EL_CMD_KEY_PARAM4	quint32
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_LIVE_PARAMETER QUuid("{705B691A-832B-4aab-8E74-0627CE8BB761}")



//--------------------------------------------------------------------------------//
/*!
	@brief	現在の動作モード設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_CURRENT_MODE QUuid("{BAD6A41A-3656-4263-A8C0-3EC668D27953}")

//--------------------------------------------------------------------------------//
/*!
	@brief	現在の動作モード設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_DO_MODE_*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_CURRENT_MODE QUuid("{2FD2D6CA-6F58-4ae8-9139-6A29313B14C7}")


//--------------------------------------------------------------------------------//
/*!
	@brief	現在の操作ロック状態設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_LOCK_STATE QUuid("{B91E4BD4-B3C9-49ac-AABE-54632D7ECB87}")

//--------------------------------------------------------------------------------//
/*!
	@brief	現在の操作ロック状態設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_KEY_*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_LOCK_STATE QUuid("{1E9C3B12-5A48-40ae-BF4D-FD37577E93C2}")


//--------------------------------------------------------------------------------//
/*!
	@brief	設定更新日時取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_UPDATE_SETTING QUuid("{5960EE4E-9EA9-442e-9ACC-77002E2F19EE}")

//--------------------------------------------------------------------------------//
/*!
	@brief	設定更新日時取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QDateTime 年月日
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_UPDATE_SETTING QUuid("{DD48F93A-4F1D-4b27-BC82-218DE4522930}")


//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュール更新日時取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_UPDATE_SCHE QUuid("{D1D475CD-4A2D-406a-92F3-1040947B34A2}")

//--------------------------------------------------------------------------------//
/*!
	@brief	スケジュール更新日時取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QDateTime 年月日
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_UPDATE_SCHE QUuid("{8A169D89-3E35-4adf-884F-AF0FEB752B52}")



//--------------------------------------------------------------------------------//
/*!
	@brief	アクティベーションフラグ設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-3
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_ACTIVATION_FLAG QUuid("{CD81F52B-9002-4443-99DD-B2B4FBC56AED}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アクティベーションフラグ設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_ACTIVATION_FLAG QUuid("{FCF8978A-FE37-480c-B455-33861C923ECB}")

//--------------------------------------------------------------------------------//
/*!
	@brief	アクティベーションフラグ設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_ACTIVATION_FLAG QUuid("{C6B27E0A-4641-4ced-9D22-F635584782B1}")


//--------------------------------------------------------------------------------//
/*!
	@brief	Wake On Lan設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-3
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_WAKE_ON_LAN QUuid("{87FDD48A-3EFB-43a2-A2C5-6BE3F42B17B0}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Wake On Lan設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_WAKE_ON_LAN QUuid("{02521A32-A763-4bc3-B991-A2D15003ECF8}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Wake On Lan設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_WAKE_ON_LAN QUuid("{B08FBAED-61BF-4186-B56B-E2E7486B876F}")


//--------------------------------------------------------------------------------//
/*!
	@brief	PortFowarding設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_PORT_FORWARDING QUuid("{92EA82D6-569C-46b1-9BF8-6240FF3A36FF}")

//--------------------------------------------------------------------------------//
/*!
	@brief	PortFowarding設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_PORT_FORWARDING QUuid("{C8B817D1-BE45-4eed-B77C-A843A10E8ADC}")

//--------------------------------------------------------------------------------//
/*!
	@brief	PortFowarding設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_PORT_FORWARDING QUuid("{528E371D-72CE-493f-A3DC-DEFC92BC508F}")


//--------------------------------------------------------------------------------//
/*!
	@brief	ポートフォワディング音声上りポート設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 (1024～65535)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_PORTFORWARDING_PORT QUuid("{FE0CE472-6F6B-42ab-AAC1-25E63303A173}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポートフォワディング音声上りポート要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_PORTFORWARDING_PORT QUuid("{000BFE01-28B2-4013-81A0-72A552E5DE7A}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポートフォワディング音声上りポート返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 (1024～65535)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_PORTFORWARDING_PORT QUuid("{7C62DE18-3A38-477c-9CEE-3F6373AE18B7}")


//--------------------------------------------------------------------------------//
/*!
	@brief	解像度パラメータ設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-5
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_FACTORY_FPS_BPS QUuid("{0E8D3423-773A-49c3-9BB7-92ADC52E4490}")

//--------------------------------------------------------------------------------//
/*!
	@brief	解像度パラメータ設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-8
			EL_CMD_KEY_PARAM3	qint32 1-30
			EL_CMD_KEY_PARAM4	quint32
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_FACTORY_FPS_BPS QUuid("{B2336B2A-2D40-4129-AC52-954E1B8AD3D3}")


//--------------------------------------------------------------------------------//
/*!
	@brief	量子化量上下限設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 (0~51)
			EL_CMD_KEY_PARAM3	qint32 (0~51)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_QUANTIZATION QUuid("{3ECB05E8-43A2-499c-8698-D9921C7918BE}")

//--------------------------------------------------------------------------------//
/*!
	@brief	量子化量上下限要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_QUANTIZATION QUuid("{6B63F4E0-6A2A-492d-A6C3-99DB333B61BE}")

//--------------------------------------------------------------------------------//
/*!
	@brief	量子化量上下限返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 (0~51)
			EL_CMD_KEY_PARAM3	qint32 (0~51)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_QUANTIZATION QUuid("{BC9764F9-8DC7-4607-BD43-0F6D204DB5F7}")


//--------------------------------------------------------------------------------//
/*!
	@brief	ダミーフレーム設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_DUMMY_FRAME QUuid("{BABF0410-7BDB-4736-947B-EFCC185772AC}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ダミーフレーム設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_DUMMY_FRAME QUuid("{B4D5AF74-1A76-4acc-8FF9-5AA8A1A70194}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ダミーフレーム設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_DUMMY_FRAME QUuid("{1DA2EF40-6A53-49a5-A141-0F0F641A2617}")


//--------------------------------------------------------------------------------//
/*!
	@brief	配信エンコード設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_DISTRI_ENCODE QUuid("{8EE86660-C562-4e63-A56D-276A76F966A3}")

//--------------------------------------------------------------------------------//
/*!
	@brief	配信エンコード設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_DISTRI_ENCODE QUuid("{01B030F2-BB29-4d3a-A360-326DA8E33B60}")

//--------------------------------------------------------------------------------//
/*!
	@brief	配信エンコード設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_DISTRI_ENCODE QUuid("{C00BEE14-687B-4436-ADB3-065F7BF2BCA4}")


//--------------------------------------------------------------------------------//
/*!
	@brief	静止画解像度設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_REC_IMAGESIZE*
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_CAPTURE_SIZE QUuid("{E213F22D-69D0-4512-B0C8-BF5CF45AAA74}")

//--------------------------------------------------------------------------------//
/*!
	@brief	静止画解像度設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_REC_IMAGESIZE*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_CAPTURE_SIZE QUuid("{D9128BA8-DE8C-45ba-8153-ABA52714F9FD}")

//--------------------------------------------------------------------------------//
/*!
	@brief	静止画解像度設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_REC_IMAGESIZE*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_CAPTURE_SIZE QUuid("{69B694C3-9F71-44de-8F59-12D387EABFED}")



//--------------------------------------------------------------------------------//
/*!
	@brief	静止画品質設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 64000~1024000
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_CAPTURE_QUARITY QUuid("{019C121B-EC8C-4f8b-AB1D-DEAE7A4EDF04}")

//--------------------------------------------------------------------------------//
/*!
	@brief	静止画品質設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 64000~1024000
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_CAPTURE_QUARITY QUuid("{019C121B-EC8C-4f8b-AB1D-DEAE7A4EDF04}")

//--------------------------------------------------------------------------------//
/*!
	@brief	静止画品質設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 64000~1024000
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_CAPTURE_QUARITY QUuid("{019C121B-EC8C-4f8b-AB1D-DEAE7A4EDF04}")


//--------------------------------------------------------------------------------//
/*!
	@brief	警戒モード種別設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_ALART*
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_ALERT_MODE QUuid("{2C03F92C-580B-41d2-89BA-283F229E6B3E}")

//--------------------------------------------------------------------------------//
/*!
	@brief	警戒モード設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_ALART*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_ALERT_MODE QUuid("{238B32FB-D95C-4ab9-97EB-F42420B22FE1}")

//--------------------------------------------------------------------------------//
/*!
	@brief	警戒モード設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_ALART*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_ALERT_MODE QUuid("{76BAD057-928B-4a57-8E59-9F3D144FB27A}")


//--------------------------------------------------------------------------------//
/*!
	@brief	ポストアラーム録画設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1~600(秒)
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_POST_ALARM_REC QUuid("{C74F84D1-C423-4219-B602-F95192D41169}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポストアラーム録画設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1~600(秒)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_POST_ALARM_REC QUuid("{999B6CCE-9434-4be2-BB1F-B05272F1EE33}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポストアラーム録画設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1~600(秒)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_POST_ALARM_REC QUuid("{8DD14502-5B1D-474b-B86F-C81B41E34DB3}")


//--------------------------------------------------------------------------------//
/*!
	@brief	低照度時グレースケール設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_GRAYSCALE QUuid("{B4121EC8-59AF-4a1a-A300-87A00481A8D8}")

//--------------------------------------------------------------------------------//
/*!
	@brief	低照度時グレースケール設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_GRAYSCALE QUuid("{B4896E94-A652-435c-A1F9-E5410D0A8A84}")

//--------------------------------------------------------------------------------//
/*!
	@brief	低照度時グレースケール設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_GRAYSCALE QUuid("{C8C4D4EA-F552-4989-AA25-0B31A4E46D70}")


//--------------------------------------------------------------------------------//
/*!
	@brief	検知アルゴリズム設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_DET_ALGORITHM*
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_DET_ALGORITHM QUuid("{D9A850C5-EEEE-4a1b-979A-49D12B9453DD}")

//--------------------------------------------------------------------------------//
/*!
	@brief	検知アルゴリズム設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_DET_ALGORITHM*
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_DET_ALGORITHM QUuid("{52AE5248-62C2-436c-8FC6-8413B885C8EA}")

//--------------------------------------------------------------------------------//
/*!
	@brief	検知アルゴリズム設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_DET_ALGORITHM*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_DET_ALGORITHM QUuid("{90139B51-5B16-4fc1-B037-228F670EAA6E}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動体/不動体設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0x01:動体, 0x02:不動体
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_MOTION_UN QUuid("{3DF1A588-0A8F-4055-83E2-ED0D2A37322B}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動体/不動体設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0x01:動体, 0x02:不動体
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_MOTION_UN QUuid("{D7516404-F091-4331-91E5-916C7D1FB97C}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動体/不動体設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0x01:動体, 0x02:不動体
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_MOTION_UN QUuid("{46231C6E-65CB-4e86-A4BE-A50DEE8F4DD2}")

//--------------------------------------------------------------------------------//
/*!
	@brief	不動体検出時間設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1~30(分)
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_UN_DETECT_TIME QUuid("{3ADE05A1-7F97-4b9f-B63B-50F07C6510D6}")

//--------------------------------------------------------------------------------//
/*!
	@brief	不動体検出時間設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1~30(分)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_UN_DETECT_TIME QUuid("{48966ABD-9179-4954-8324-9AB82A37A96D}")

//--------------------------------------------------------------------------------//
/*!
	@brief	不動体検出時間設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1~30(分)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_UN_DETECT_TIME QUuid("{1C645A8F-CBAF-4804-82C5-E01B0068DC52}")


//--------------------------------------------------------------------------------//
/*!
	@brief	動体検出時間設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1~60(秒)
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_DETECTION_TIME QUuid("{998F6D12-C304-4e59-9036-0C3F9CE61580}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動体検出時間設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1~60(秒)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_DETECTION_TIME QUuid("{D212E5CE-3A05-4cf8-A54E-516471BC3F77}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動体検出時間設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1~60(秒)
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_DETECTION_TIME QUuid("{8F695BC4-97E2-4eb5-8EB2-E649D4866790}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動体判定サイズ設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1~10
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_MOTION_SIZE QUuid("{DB65DFE4-D355-4594-888A-2A03299EED2C}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動体判定サイズ設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1~10
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_MOTION_SIZE QUuid("{E7C5A017-858A-4a41-8C6A-ED5AC00C20FD}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動体判定サイズ設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1~10
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_MOTION_SIZE QUuid("{55D8F8A9-BAF0-4a5a-9CD6-2910381BF7C1}")


//--------------------------------------------------------------------------------//
/*!
	@brief	動体検知枠表示設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_MOTION_FRAME QUuid("{26C79E85-D9C2-421e-8BB1-ED641FEBA1E3}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動体検知枠表示設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_MOTION_FRAME QUuid("{487E1100-B21D-4527-A9D6-E60DEE12BC85}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動体検知枠表示設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_MOTION_FRAME QUuid("{E2C34A96-39E0-4570-90EB-E7DB2F1CC6E7}")

//--------------------------------------------------------------------------------//
/*!
	@brief	顔検出感度設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1~10
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_FACE_SENS QUuid("{6F0FDB79-36C5-499d-9E41-24361264AA55}")

//--------------------------------------------------------------------------------//
/*!
	@brief	顔検出感度設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1~10
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_FACE_SENS QUuid("{1837319C-367D-4bb9-962B-7EBE9743ED7B}")

//--------------------------------------------------------------------------------//
/*!
	@brief	顔検出感度設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1~10
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_FACE_SENS QUuid("{E69B901B-EC6A-4900-A4BC-FF614B7AF4AB}")

//--------------------------------------------------------------------------------//
/*!
	@brief	顔検出枠表示設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_FACE_FRAME QUuid("{A3620FD0-671F-41fe-86B7-0D2535DA5E34}")

//--------------------------------------------------------------------------------//
/*!
	@brief	顔検出枠表示設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_FACE_FRAME QUuid("{4EAE8AEF-1B33-4c05-8C2F-A3E4325FAFAC}")

//--------------------------------------------------------------------------------//
/*!
	@brief	顔検出枠表示設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_FACE_FRAME QUuid("{C5622255-EDA9-4ddc-BE54-EFA02DEFB448}")

//--------------------------------------------------------------------------------//
/*!
	@brief	動的動作モード変更
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 QBIC_VALUE_DO_MODE_*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_CHG_MOTION_MODE QUuid("{6D3ED965-117C-4dfa-88B6-CF3DD427D2F2}")


//--------------------------------------------------------------------------------//
/*!
	@brief	操作ロック状態変更
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 QBIC_VALUE_KEY_*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_CHG_LOCK_MODE QUuid("{539BCABD-1F53-41ab-B272-1D9241FA4FD0}")


//--------------------------------------------------------------------------------//
/*!
	@brief	動的スケジュール変更
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 QBIC_VALUE_KEY_*
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_CHG_SCHE_MODE QUuid("{9114A2D5-A522-4e3a-AFDE-0999E7DEEE75}")


//--------------------------------------------------------------------------------//
/*!
	@brief	現在接続中のIPアドレス取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_USE_IPADDR QUuid("{4EABB30F-2E94-4b72-838F-78759F055FCD}")

//--------------------------------------------------------------------------------//
/*!
	@brief	現在接続中のIPアドレス取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString アドレス(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_USE_IPADDR QUuid("{BEEBF8B9-4C23-4724-9A01-EBF5A1AC42C1}")


//--------------------------------------------------------------------------------//
/*!
	@brief	プライベートマスクONOFF設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_PRI_MASK_ONOFF QUuid("{0123A66A-ECD2-4649-9C7D-E7F0B73AE4F9}")

//--------------------------------------------------------------------------------//
/*!
	@brief	プライベートマスクONOFF設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_PRI_MASK_ONOFF QUuid("{D2863AA1-5AEA-42da-804F-5B8715391924}")

//--------------------------------------------------------------------------------//
/*!
	@brief	プライベートマスクONOFF設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_PRI_MASK_ONOFF QUuid("{1FF85F26-93A5-445c-A176-A61727954EED}")


//--------------------------------------------------------------------------------//
/*!
	@brief	プライベートマスク位置設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 x
			EL_CMD_KEY_PARAM3	qint32 y
			EL_CMD_KEY_PARAM4	qint32 w
			EL_CMD_KEY_PARAM5	qint32 h
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_PRI_MASK_POS QUuid("{5B2B2BD5-6046-46af-B1F2-F0C3905CD32F}")

//--------------------------------------------------------------------------------//
/*!
	@brief	プライベートマスク位置設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 x
			EL_CMD_KEY_PARAM3	qint32 y
			EL_CMD_KEY_PARAM4	qint32 w
			EL_CMD_KEY_PARAM5	qint32 h
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_PRI_MASK_POS QUuid("{A823A267-88BC-484a-9CBC-B5F82E4D682A}")

//--------------------------------------------------------------------------------//
/*!
	@brief	プライベートマスク位置設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_PRI_MASK_POS QUuid("{8627E8B1-F2B1-4d71-BE5F-CDB3A4B09D71}")


//--------------------------------------------------------------------------------//
/*!
	@brief	Jpegライブパラメータ設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-3
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_JPEG_LIVE_PARAM QUuid("{91C27211-CF15-4e71-8965-92CE88129672}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Jpegライブパラメータ設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-3
			EL_CMD_KEY_PARAM3	qint32 1-30
			EL_CMD_KEY_PARAM4	quint32 1-5
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_JPEG_LIVE_PARAM QUuid("{264F0939-8224-4bda-950B-5BAF7C09DCE2}")

//--------------------------------------------------------------------------------//
/*!
	@brief	Jpegライブパラメータ設定設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 1-3
			EL_CMD_KEY_PARAM3	qint32 1-30
			EL_CMD_KEY_PARAM4	quint32 1-5
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_JPEG_LIVE_PARAM QUuid("{00DEBC4D-098A-416a-8A01-D447164BB5C2}")


//--------------------------------------------------------------------------------//
/*!
	@brief	ポーリング接続先URI要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_POLL_SERVER QUuid("{C3127FC1-E805-413f-B2E9-FCD8E0763C12}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポーリング接続先URI要求返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString ポーリング接続先URI
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_POLL_SERVER QUuid("{F9ABCA10-EEF0-44b8-A1DA-92ADD0B03C4D}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポーリング接続先URI設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString ポーリング接続先URI
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_POLL_SERVER QUuid("{6591A372-80BB-4838-9508-BD0F0535B104}")


//--------------------------------------------------------------------------------//
/*!
	@brief	ポーリング接続先ポート番号要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_POLL_PORT QUuid("{668AF47E-74CD-4bf8-A6CF-C79444DDF4DF}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポーリング接続先ポート番号返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32	1～65535
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_POLL_PORT QUuid("{1127FBDC-E8D8-4e4d-8597-52779AD16BB7}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポーリング接続先ポート番号設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32	1～65535
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_POLL_PORT QUuid("{26F4CCB5-D8B5-4121-939C-8453E1DE1A3B}")


//--------------------------------------------------------------------------------//
/*!
	@brief	SSL要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_USE_SSL QUuid("{BE53B19D-194E-460d-AE59-5C8350F3B6FE}")

//--------------------------------------------------------------------------------//
/*!
	@brief	SSL返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_USE_SSL QUuid("{A3737205-0119-4727-87E9-151FF891B167}")

//--------------------------------------------------------------------------------//
/*!
	@brief	SSL設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_USE_SSL QUuid("{D318136E-7153-4d0d-B351-971B86025BBD}")


//--------------------------------------------------------------------------------//
/*!
	@brief	ポートフォワーディング用グローバルIPアドレス取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define	USB_REQ_QBIC_CMD_GET_PORTFWD_IP	QUuid("{3F31A0FF-7721-483d-B905-559F25386284}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポートフォワーディング用グローバルIPアドレス取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString アドレス(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define	USB_RES_QBIC_CMD_GET_PORTFWD_IP	QUuid("{A73F1533-7AAF-4d40-9EA3-49D140C6F076}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポートフォワーディング用グローバルIPアドレス設定
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString アドレス(IPv4形式)
*/
//--------------------------------------------------------------------------------//
#define	USB_QBIC_CMD_SET_PORTFWD_IP	QUuid("{5C1D215E-6361-4007-9CD3-A68221CF9A91}")


//--------------------------------------------------------------------------------//
/*!
	@brief	ポートフォワーディング用映像下りポート番号要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define	USB_REQ_QBIC_CMD_GET_PORTFWD_PIC_DOWN	QUuid("{52E97520-252F-4db5-83E1-95C5D10E8FE0}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポートフォワーディング用映像下りポート番号返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 (1024～65535)
*/
//--------------------------------------------------------------------------------//
#define	USB_RES_QBIC_CMD_GET_PORTFWD_PIC_DOWN	QUuid("{3640FBFD-8646-405f-88F6-CBCC32A9A63A}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポートフォワーディング用映像下りポート番号設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 (1024～65535)
*/
//--------------------------------------------------------------------------------//
#define	USB_QBIC_CMD_SET_PORTFWD_PIC_DOWN	QUuid("{FDB476A4-18CC-4924-84B6-847B8B418A87}")


//--------------------------------------------------------------------------------//
/*!
	@brief	ポートフォワーディング用映像下りRTCPポート番号要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define	USB_REQ_QBIC_CMD_GET_PORTFWD_PIC_DOWN_CTRL	QUuid("{25BF5413-7AAF-41c1-BC22-9185D7158504}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポートフォワーディング用映像下りRTCPポート番号返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 (1024～65535)
*/
//--------------------------------------------------------------------------------//
#define	USB_RES_QBIC_CMD_GET_PORTFWD_PIC_DOWN_CTRL	QUuid("{7E034D87-D395-469c-80A3-8367CBA836C9}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポートフォワーディング用映像下りRTCPポート番号設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 (1024～65535)
*/
//--------------------------------------------------------------------------------//
#define	USB_QBIC_CMD_SET_PORTFWD_PIC_DOWN_CTRL	QUuid("{9113EF58-E7D8-41ec-B8FC-CB85E6583B13}")


//--------------------------------------------------------------------------------//
/*!
	@brief	ポートフォワーディング用音声下りポート番号要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define	USB_REQ_QBIC_CMD_GET_PORTFWD_AUD_DOWN	QUuid("{2B2A839A-C4E5-44c2-9510-9C2A13087259}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポートフォワーディング用音声下りポート番号返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 (1024～65535)
*/
//--------------------------------------------------------------------------------//
#define	USB_RES_QBIC_CMD_GET_PORTFWD_AUD_DOWN	QUuid("{5021FC94-2338-4b4d-9517-DB2A017CDF50}")

//--------------------------------------------------------------------------------//
/*!
	@brief	ポートフォワーディング用音声下りポート番号設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 (1024～65535)
*/
//--------------------------------------------------------------------------------//
#define	USB_QBIC_CMD_SET_PORTFWD_AUD_DOWN	QUuid("{3D11CC5B-FF26-4aae-9CF4-A1ACF1D0F901}")


//--------------------------------------------------------------------------------//
/*!
	@brief	リリースバージョン取得要求
	@detals
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_RELEASE_VERSION QUuid("{08DE1D87-C4DD-48d5-8ED1-C9C78D2140DA}")

//--------------------------------------------------------------------------------//
/*!
	@brief	リリースバージョン取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString バージョン
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_RELEASE_VERSION QUuid("{6041B78C-4C96-4fc8-AD4A-167C4F79D026}")


//--------------------------------------------------------------------------------//
/*!
	@brief	グローバルIPアドレス解決に用いるポート番号取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define	USB_REQ_QBIC_CMD_GET_PORTFWD_PORT_FOR_GIP QUuid("{9BCDDF32-41D9-4678-9BAD-0993A2EA6AF9}")

//--------------------------------------------------------------------------------//
/*!
	@brief	グローバルIPアドレス解決に用いるポート番号取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 (1024～65535)
*/
//--------------------------------------------------------------------------------//
#define	USB_RES_QBIC_CMD_GET_PORTFWD_PORT_FOR_GIP QUuid("{9D4D2455-693C-4ec3-BBA2-AD93AF42BEFB}")

//--------------------------------------------------------------------------------//
/*!
	@brief	グローバルIPアドレス解決に用いるポート番号設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 (1024～65535)
*/
//--------------------------------------------------------------------------------//
#define	USB_QBIC_CMD_SET_PORTFWD_PORT_FOR_GIP QUuid("{34F452FB-8730-4c5d-832E-39EC4195EDEE}")

//--------------------------------------------------------------------------------//
/*!
	@brief	自動LEDオフ設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_LED_AUTOOFF QUuid("{0e34dd4c-193e-4d96-b5e2-6e5dac75bec4}")


//--------------------------------------------------------------------------------//
/*!
	@brief	自動LEDオフ設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 設定値
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_LED_AUTOOFF QUuid("{5522aa97-bf86-4b7d-a234-9863a0c8f949}")

//--------------------------------------------------------------------------------//
/*!
	@brief	自動LEDオフ設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 設定値
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_LED_AUTOOFF QUuid("{17a6db18-57e8-43fe-ba4b-666d5941c7b0}")

//--------------------------------------------------------------------------------//
/*!
	@brief	自動復旧設定取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_AUTOPOWERON QUuid("{bc5d77e8-fd43-4127-bbaf-7979b72288c1}")

//--------------------------------------------------------------------------------//
/*!
	@brief	自動復旧設定取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 設定値
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_AUTOPOWERON QUuid("{85ef5002-4b4f-4fd1-80cd-60386ccd2f29}")

//--------------------------------------------------------------------------------//
/*!
	@brief	自動復旧設定取得
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	bool 設定値
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_AUTOPOWERON QUuid("{b5001435-2e18-44a6-868b-b1946d2cfe08}")

//--------------------------------------------------------------------------------//
/*!
	@brief	グローバルIP取得方法取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_REQ_QBIC_CMD_GET_GLOBALIP_GETMODE QUuid("{1aadef30-f529-45a7-a275-4cb7af42be0b}")

//--------------------------------------------------------------------------------//
/*!
	@brief	グローバルIP取得方法取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_GLOBALIP_FROM_* 設定値
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_GET_GLOBALIP_GETMODE QUuid("{db49705a-85e3-40a7-b3e2-e58cadc23f04}")

//--------------------------------------------------------------------------------//
/*!
	@brief	グローバルIP取得方法設定
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QBIC_VALUE_GLOBALIP_FROM_* 設定値
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_SET_GLOBALIP_GETMODE QUuid("{5a868ea6-ec26-4db5-8029-c1dbe6c8e131}")

//--------------------------------------------------------------------------------//
/*!
	@brief	USBストリーム開始
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_STREAM_START QUuid("{88881490-7B08-4347-8903-D9D2251C3765}")

//--------------------------------------------------------------------------------//
/*!
	@brief	USBストリームスティール
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_CMD_REQ_STREAM_STEAL QUuid("{5689D40C-A676-401c-B0C0-3C0EDFCBACB3}")

//--------------------------------------------------------------------------------//
/*!
	@brief	USBストリーム停止
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_STREAM_END QUuid("{F7B82B9B-5EFA-4807-8FA4-F7F0A7F97E6F}")


//--------------------------------------------------------------------------------//
/*!
	@brief	音確認
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	qint32 0x01~0x08
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_CHK_SOUND_EFFECT QUuid("{F7992666-0DCC-4fff-B8E9-B941E380F228}")


//--------------------------------------------------------------------------------//
/*!
	@brief	画像データ通知
	@details
			EL_CMD_KEY_PARAM1	void* データ受信したデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QImage　画像
*/
//--------------------------------------------------------------------------------//
#define USB_CMD_RES_STREAM_STEAL QUuid("{09B594BE-5AF2-4e8a-BFB0-F7B523BD2350}")


//--------------------------------------------------------------------------------//
/*!
	@brief	USBログ取得要求
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
*/
//--------------------------------------------------------------------------------//
#define USB_QBIC_CMD_REQ_LOG QUuid("{979163B3-4219-4b8b-AD7C-D2919D2B3B95}")

//--------------------------------------------------------------------------------//
/*!
	@brief	USBログ取得返信
	@details
			EL_CMD_KEY_PARAM1	void* データ通信するデバイス操作クラスのポインタ
			EL_CMD_KEY_PARAM2	QString ログ
*/
//--------------------------------------------------------------------------------//
#define USB_RES_QBIC_CMD_LOG QUuid("{C53C6FDF-35AC-4acd-A0DB-02E28D0415D1}")

#endif //COMMAND_H
