//--------------------------------------------------------------------------------//
/*!
	@file	ClImageView2.h
	@brief	アスペクト比維持画像表示ウィジェットヘッダ
	@author	大橋
*/
//--------------------------------------------------------------------------------//
#ifndef CLIMAGEVIEW2_H
#define CLIMAGEVIEW2_H
#include "ImageView/ClImageView.h"

//--------------------------------------------------------------------------------//
/*!
	@brief	アスペクト比維持画像表示ウィジェットヘッダ
*/
//--------------------------------------------------------------------------------//
class ClImageView2 : public ClImageView
{
public:
	ClImageView2(QWidget *pclParent = NULL);	//コンストラクタ

protected:
	virtual void paintEvent(QPaintEvent *);	//描画イベント
};
//--------------------------------------------------------------------------------//
#endif //CLIMAGEVIEW2_H
